# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=LDAP \ucee4\ub125\ud130

# Configuration properties.
host.display=\ud638\uc2a4\ud2b8
host.help=LDAP \uc11c\ubc84\uac00 \uc2e4\ud589\ub418\ub294 \ud638\uc2a4\ud2b8\uc758 \uc774\ub984 \ub610\ub294 IP \uc8fc\uc18c\uc785\ub2c8\ub2e4.
port.display=TCP \ud3ec\ud2b8
port.help=LDAP \uc11c\ubc84\uc640 \ud1b5\uc2e0\ud558\ub294 \ub370 \uc0ac\uc6a9\ub418\ub294 TCP/IP \ud3ec\ud2b8 \ubc88\ud638\uc785\ub2c8\ub2e4.
ssl.display=SSL
ssl.help=SSL\uc744 \uc0ac\uc6a9\ud558\uc5ec LDAP \uc11c\ubc84\uc5d0 \uc5f0\uacb0\ud558\ub824\uba74 \uc774 \ud655\uc778\ub780\uc744 \uc120\ud0dd\ud569\ub2c8\ub2e4.
failover.display=\ud398\uc77c\uc624\ubc84 \uc11c\ubc84
failover.help=\uae30\ubcf8 \uc11c\ubc84\uac00 \uc2e4\ud328\ud560 \uacbd\uc6b0 \ud398\uc77c\uc624\ubc84\uc5d0 \uc0ac\uc6a9\ud560 \ubaa8\ub4e0 \uc11c\ubc84\ub97c \ub098\uc5f4\ud569\ub2c8\ub2e4. \uae30\ubcf8 \uc11c\ubc84\uac00 \uc2e4\ud328\ud558\uba74 JNDI\ub294 \ubaa9\ub85d\uc5d0\uc11c \uc0ac\uc6a9 \uac00\ub2a5\ud55c \ub2e4\uc74c \uc11c\ubc84\uc5d0 \uc5f0\uacb0\ud569\ub2c8\ub2e4. RFC 2255\uc5d0 \uc124\uba85\ub41c \ud45c\uc900 LDAP v3 URL\uc744 \ub530\ub974\ub294 "ldap://ldap.example.com:389/" \ud615\uc2dd\uc73c\ub85c \ubaa8\ub4e0 \uc11c\ubc84\ub97c \ub098\uc5f4\ud569\ub2c8\ub2e4. URL \ubd80\ubd84\uc5d0\uc11c \ud638\uc2a4\ud2b8 \ubc0f \ud3ec\ud2b8 \ubd80\ubd84\ub9cc \uc774 \uc124\uc815\uc5d0 \ub530\ub77c \ubc14\ub01d\ub2c8\ub2e4.
principal.display=\uae30\ubcf8 \uc0ac\uc6a9\uc790
principal.help=LDAP \uc11c\ubc84\uc5d0 \uc778\uc99d\ud558\ub294 \ub370 \uc0ac\uc6a9\ub418\ub294 \uace0\uc720 \uc774\ub984\uc785\ub2c8\ub2e4.
credentials.display=\ube44\ubc00\ubc88\ud638
credentials.help=\uae30\ubcf8 \uc0ac\uc6a9\uc790\uc758 \ube44\ubc00\ubc88\ud638\uc785\ub2c8\ub2e4.
baseContexts.display=\uae30\ubcf8 \ucee8\ud14d\uc2a4\ud2b8
baseContexts.help=\ud2b8\ub9ac\ub97c \uac80\uc0c9\ud560 \ub54c \uc0ac\uc6a9\ud560 LDAP \ud2b8\ub9ac\uc758 \uc2dc\uc791 \uc9c0\uc810 \ud558\ub098 \uc774\uc0c1\uc744 \uc758\ubbf8\ud569\ub2c8\ub2e4. \uac80\uc0c9\uc740 LDAP \uc11c\ubc84\uc5d0\uc11c \uc0ac\uc6a9\uc790\ub97c \uac80\uc0c9\ud560 \ub54c \ub610\ub294 \uc0ac\uc6a9\uc790\uac00 \uc18d\ud55c \uadf8\ub8f9\uc744 \ucc3e\uc744 \ub54c \uc218\ud589\ub429\ub2c8\ub2e4.
passwordAttribute.display=\ube44\ubc00\ubc88\ud638 \uc18d\uc131
passwordAttribute.help=\ube44\ubc00\ubc88\ud638\ub97c \ud3ec\ud568\ud558\ub294 LDAP \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. \uc0ac\uc6a9\uc790\uc758 \ube44\ubc00\ubc88\ud638\ub97c \ubcc0\uacbd\ud560 \ub54c \uc0c8 \ube44\ubc00\ubc88\ud638\uac00 \uc774 \uc18d\uc131\uc73c\ub85c \uc124\uc815\ub429\ub2c8\ub2e4.
accountObjectClasses.display=\uacc4\uc815 \uac1d\uccb4 \ud074\ub798\uc2a4
accountObjectClasses.help=LDAP \ud2b8\ub9ac\uc5d0\uc11c \uc0c8 \uc0ac\uc6a9\uc790\ub97c \ub9cc\ub4e4 \ub54c \uc0ac\uc6a9\ud560 \uac1d\uccb4 \ud074\ub798\uc2a4(\ubcf5\uc218 \uac00\ub2a5)\uc785\ub2c8\ub2e4. \ud074\ub798\uc2a4\ub97c \uc5ec\ub7ec \uac1c \uc785\ub825\ud558\ub294 \uacbd\uc6b0\uc5d0\ub294 \uac01 \uc904\uc5d0 \ud56d\ubaa9\uc744 \ud558\ub098\ub9cc \uc785\ub825\ud574\uc57c \ud558\uba70 \uc27c\ud45c\ub098 \uc138\ubbf8\ucf5c\ub860\uc744 \uc0ac\uc6a9\ud558\uc5ec \ubcf5\uc218 \uac1d\uccb4 \ud074\ub798\uc2a4\ub97c \ubd84\ub9ac\ud558\uba74 \uc548 \ub429\ub2c8\ub2e4. \uac1d\uccb4 \ud074\ub798\uc2a4\uc5d0 \ub530\ub77c \ud074\ub798\uc2a4 \uacc4\uce35\uc758 \ubaa8\ub4e0 \ud074\ub798\uc2a4\ub97c \uc9c0\uc815\ud574\uc57c \ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
accountUserNameAttributes.display=\uacc4\uc815 \uc0ac\uc6a9\uc790 \uc774\ub984 \uc18d\uc131
accountUserNameAttributes.help=\uacc4\uc815\uc758 \uc0ac\uc6a9\uc790 \uc774\ub984(\ubcf5\uc218 \uac00\ub2a5)\uc774 \ud3ec\ud568\ub41c \uc18d\uc131\uc785\ub2c8\ub2e4. \uc774\ub7ec\ud55c \uc18d\uc131\uc740 \uc778\uc99d\ud560 \uc0ac\uc6a9\uc790 \uc774\ub984\uc5d0 \ub300\ud55c LDAP \ud56d\ubaa9\uc744 \ucc3e\uae30 \uc704\ud574 \uc778\uc99d\ud560 \ub54c \uc0ac\uc6a9\ub429\ub2c8\ub2e4.
accountSearchFilter.display=\uacc4\uc815 \uac80\uc0c9\uc744 \uc704\ud55c LDAP \ud544\ud130
accountSearchFilter.help=LDAP \uc790\uc6d0\uc5d0\uc11c \ubc18\ud658\ub418\ub294 \uacc4\uc815\uc744 \uc81c\uc5b4\ud560 \uc120\ud0dd\uc801 LDAP \ud544\ud130\uc785\ub2c8\ub2e4. \ud544\ud130\ub97c \uc9c0\uc815\ud558\uc9c0 \uc54a\uc73c\uba74 \uc9c0\uc815\ub41c \uac1d\uccb4 \ud074\ub798\uc2a4\uac00 \ubaa8\ub450 \ud3ec\ud568\ub41c \uacc4\uc815\ub9cc \ubc18\ud658\ub429\ub2c8\ub2e4.
groupMemberAttribute.display=\uadf8\ub8f9 \uad6c\uc131\uc6d0 \uc18d\uc131
groupMemberAttribute.help=\uc0ac\uc6a9\uc790\uac00 \uadf8\ub8f9\uc5d0 \ucd94\uac00\ub420 \ub54c \uc0ac\uc6a9\uc790\uc758 \uace0\uc720 \uc774\ub984\uc73c\ub85c \uc5c5\ub370\uc774\ud2b8\ub420 \uadf8\ub8f9 \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4.
maintainLdapGroupMembership.display=LDAP \uadf8\ub8f9 \uad6c\uc131\uc6d0 \uc720\uc9c0
maintainLdapGroupMembership.help=\ud65c\uc131\ud654\ud55c \uc0c1\ud0dc\uc5d0\uc11c \uc0ac\uc6a9\uc790 \uc774\ub984\uc744 \ubcc0\uacbd\ud558\uac70\ub098 \uc0ac\uc6a9\uc790\ub97c \uc0ad\uc81c\ud558\uba74 \uc0c8 \uc774\ub984\uc744 \ubc18\uc601\ud558\ub3c4\ub85d \uc0ac\uc6a9\uc790\uac00 \uc18d\ud55c LDAP \uadf8\ub8f9\uc744 \uc5c5\ub370\uc774\ud2b8\ud569\ub2c8\ub2e4. \ud65c\uc131\ud654\ud558\uc9c0 \uc54a\uc73c\uba74 LDAP \uc790\uc6d0\uc740 \uadf8\ub8f9 \uad6c\uc131\uc6d0\uacfc \uad00\ub828\ud558\uc5ec \ucc38\uc870 \ubb34\uacb0\uc131\uc744 \uc720\uc9c0\ud574\uc57c \ud569\ub2c8\ub2e4.
maintainPosixGroupMembership.display=POSIX \uadf8\ub8f9 \uad6c\uc131\uc6d0 \uc720\uc9c0
maintainPosixGroupMembership.help=\ud65c\uc131\ud654\ud55c \uc0c1\ud0dc\uc5d0\uc11c \uc0ac\uc6a9\uc790 \uc774\ub984\uc744 \ubcc0\uacbd\ud558\uac70\ub098 \uc0ac\uc6a9\uc790\ub97c \uc0ad\uc81c\ud558\uba74 \uc0c8 \uc774\ub984\uc744 \ubc18\uc601\ud558\ub3c4\ub85d \uc0ac\uc6a9\uc790\uac00 \uc18d\ud55c POSIX \uadf8\ub8f9\uc744 \uc5c5\ub370\uc774\ud2b8\ud569\ub2c8\ub2e4. \ud65c\uc131\ud654\ud558\uc9c0 \uc54a\uc73c\uba74 LDAP \uc790\uc6d0\uc740 \uadf8\ub8f9 \uad6c\uc131\uc6d0\uacfc \uad00\ub828\ud558\uc5ec \ucc38\uc870 \ubb34\uacb0\uc131\uc744 \uc720\uc9c0\ud574\uc57c \ud569\ub2c8\ub2e4.
passwordHashAlgorithm.display=\ube44\ubc00\ubc88\ud638 \ud574\uc2dc \uc54c\uace0\ub9ac\uc998
passwordHashAlgorithm.help=Identity System\uc774 \ube44\ubc00\ubc88\ud638\ub97c \ud574\uc2dc\ud560 \ub54c \uc0ac\uc6a9\ud560 \uc54c\uace0\ub9ac\uc998\uc744 \ub098\ud0c0\ub0c5\ub2c8\ub2e4. \ud604\uc7ac \uc9c0\uc6d0\ub418\ub294 \uac12\uc740 SSHA, SHA, SMD5 \ubc0f MD5\uc785\ub2c8\ub2e4. \uac12\uc774 \ube44\uc5b4 \uc788\ub294 \uacbd\uc6b0 \ube44\ubc00\ubc88\ud638\uac00 \ud574\uc2dc\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc774 \ub54c LDAP \uc11c\ubc84\uac00 \ud574\uc2dc\ub97c \uc218\ud589\ud558\uc9c0 \uc54a\ub294 \uacbd\uc6b0(Netscape Directory Server \ubc0f iPlanet Directory Server\ub294 \uc218\ud589) \ubcf4\ud1b5 \ud14d\uc2a4\ud2b8 \ube44\ubc00\ubc88\ud638\uac00 LDAP\uc5d0 \uc800\uc7a5\ub429\ub2c8\ub2e4.
respectResourcePasswordPolicyChangeAfterReset.display=\uc790\uc6d0 \ube44\ubc00\ubc88\ud638 \uc815\ucc45 \uc7ac\uc124\uc815 \ud6c4 \ubcc0\uacbd \uace0\ub824
respectResourcePasswordPolicyChangeAfterReset.help=\uc774 \uc790\uc6d0\uc774 \ub85c\uadf8\uc778 \ubaa8\ub4c8\uc5d0 \uc9c0\uc815\ub418\uace0(\uc989, \uc774 \uc790\uc6d0\uc774 \ud1b5\uacfc(pass-through) \uc778\uc99d \ub300\uc0c1), \uc790\uc6d0\uc758 \ube44\ubc00\ubc88\ud638 \uc815\ucc45\uc774 \uc7ac\uc124\uc815 \ud6c4 \ubcc0\uacbd\uc73c\ub85c \uad6c\uc131\ub418\uc5b4 \uc788\uc73c\uba74 \uc790\uc6d0 \uacc4\uc815 \ube44\ubc00\ubc88\ud638\uac00 \uad00\ub9ac \ubaa9\uc801\uc73c\ub85c \uc7ac\uc124\uc815\ub41c \uc0ac\uc6a9\uc790\ub294 \uc778\uc99d \ud6c4\uc5d0 \ud574\ub2f9 \ube44\ubc00\ubc88\ud638\ub97c \ubcc0\uacbd\ud574\uc57c \ud569\ub2c8\ub2e4.
useBlocks.display=\ube14\ub85d \uc0ac\uc6a9
useBlocks.help=\uacc4\uc815 \uc218\uac00 \ub9ce\uc740 \uc791\uc5c5\uc744 \uc218\ud589\ud558\ub294 \uacbd\uc6b0 \uacc4\uc815\uc744 \ube14\ub85d \ub2e8\uc704\ub85c \ucc98\ub9ac\ud558\uc5ec \uc791\uc5c5\uc5d0 \uc0ac\uc6a9\ub418\ub294 \uba54\ubaa8\ub9ac\uc758 \uc591\uc744 \uc808\uc57d\ud569\ub2c8\ub2e4. \ube14\ub85d\uc758 \uacc4\uc815\uc744 \ucc98\ub9ac\ud558\ub824\uba74 \uc774 \uc635\uc158\uc744 \uc120\ud0dd\ud558\uc2ed\uc2dc\uc624.
blockSize.display=\ube14\ub85d \ud06c\uae30
blockSize.help=\ube14\ub85d\uc758 \uacc4\uc815\uc744 \uac80\uc0c9\ud560 \ub54c \ud55c \ube14\ub85d\uc5d0 \ud3ec\ud568\ud560 \uc218 \uc788\ub294 \ucd5c\ub300 \uacc4\uc815 \uc218\uc785\ub2c8\ub2e4.
usePagedResultControl.display=\ud398\uc774\uc9d5\ub41c \uacb0\uacfc \uc81c\uc5b4 \uc0ac\uc6a9
usePagedResultControl.help=\uc774 \uc635\uc158\uc744 \ud65c\uc131\ud654\ud558\uba74, \uacc4\uc815\uc744 \uac80\uc0c9\ud560 \ub54c LDAP \ud398\uc774\uc9d5\ub41c \uacb0\uacfc \uc81c\uc5b4\uac00 VLV \uc81c\uc5b4\uc5d0 \uc6b0\uc120\ud569\ub2c8\ub2e4.
vlvSortAttribute.display=VLV \uc815\ub82c \uc18d\uc131
vlvSortAttribute.help=\uc790\uc6d0\uc5d0 \ub300\ud55c VLV \uc0c9\uc778\uc5d0 \uc0ac\uc6a9\ud560 \uc815\ub82c \uc18d\uc131\uc744 \uc9c0\uc815\ud558\uc2ed\uc2dc\uc624.
uidAttribute.display=UID \uc18d\uc131
uidAttribute.help=UID \uc18d\uc131\uc5d0 \ub9e4\ud551\ub41c LDAP \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4.
readSchema.display=\uc2a4\ud0a4\ub9c8 \uc77d\uae30
readSchema.help=true\ub85c \uc124\uc815\ud560 \uacbd\uc6b0 \ucee4\ub125\ud130\uac00 \uc11c\ubc84\uc5d0\uc11c \uc2a4\ud0a4\ub9c8\ub97c \uc77d\uc2b5\ub2c8\ub2e4. false\ub85c \uc124\uc815\ud560 \uacbd\uc6b0 \ucee4\ub125\ud130\uac00 \uad6c\uc131\uc758 \uac1d\uccb4 \ud074\ub798\uc2a4\uc5d0 \ub530\ub77c \uae30\ubcf8 \uc2a4\ud0a4\ub9c8\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4. \ud655\uc7a5 \uac1d\uccb4 \ud074\ub798\uc2a4\ub97c \uc0ac\uc6a9\ud558\ub824\uba74 \uc774 \ub4f1\ub85d \uc815\ubcf4\uac00 true\uc5ec\uc57c \ud569\ub2c8\ub2e4.
extendedObjectClasses.display=\ud655\uc7a5 \uac1d\uccb4 \ud074\ub798\uc2a4
extendedObjectClasses.help=\uc2a4\ud0a4\ub9c8\uc5d0 \uc81c\uacf5\ud560 \ucd94\uac00 \uac1d\uccb4 \ud074\ub798\uc2a4\uc785\ub2c8\ub2e4. \uc774 \ub4f1\ub85d \uc815\ubcf4\uac00 \ube44\uc5b4 \uc788\uc9c0 \uc54a\uc73c\uba74 "readSchema" \ub4f1\ub85d \uc815\ubcf4\ub97c true\ub85c \uc124\uc815\ud574\uc57c \ud569\ub2c8\ub2e4.
baseContextsToSynchronize.display=\ub3d9\uae30\ud654\ud560 \uae30\ubcf8 \ucee8\ud14d\uc2a4\ud2b8
baseContextsToSynchronize.help=\ubcc0\uacbd \ub0b4\uc6a9\uc744 \ub3d9\uae30\ud654\ud574\uc57c \ud558\ub294\uc9c0 \uacb0\uc815\ud560 \ub54c \uc0ac\uc6a9\ud560 LDAP \ud2b8\ub9ac\uc758 \uc2dc\uc791 \uc9c0\uc810 \ud558\ub098 \uc774\uc0c1\uc744 \uc758\ubbf8\ud569\ub2c8\ub2e4. \uc774 \ub4f1\ub85d \uc815\ubcf4\ub97c \uc124\uc815\ud558\uc9c0 \uc54a\uc740 \uacbd\uc6b0\uc5d0\ub294 \uae30\ubcf8 \ucee8\ud14d\uc2a4\ud2b8 \uc18d\uc131\uc744 \uc0ac\uc6a9\ud558\uc5ec \ubcc0\uacbd \ub0b4\uc6a9\uc744 \ub3d9\uae30\ud654\ud569\ub2c8\ub2e4.
objectClassesToSynchronize.display=\ub3d9\uae30\ud654\ud560 \uac1d\uccb4 \ud074\ub798\uc2a4
objectClassesToSynchronize.help=\ub3d9\uae30\ud654\ud560 \uac1d\uccb4 \ud074\ub798\uc2a4\uc785\ub2c8\ub2e4. \ubcc0\uacbd \ub85c\uadf8\ub294 \ubaa8\ub4e0 \uac1d\uccb4\uc5d0 \ub300\ud55c \uac83\uc774\uae30 \ub54c\ubb38\uc5d0 \uc774 \ud544\ud130\ub294 \ub098\uc5f4\ub41c \uac1d\uccb4 \ud074\ub798\uc2a4\ub9cc \uc5c5\ub370\uc774\ud2b8\ud569\ub2c8\ub2e4. \uac1d\uccb4\ub97c \uc218\ud37c\ud074\ub798\uc2a4 \uac12\uc73c\ub85c \ub3d9\uae30\ud654\ud558\ub824\ub294 \uacbd\uc6b0\uac00 \uc544\ub2c8\uba74 \uac1d\uccb4 \ud074\ub798\uc2a4\uc758 \uc218\ud37c\ud074\ub798\uc2a4\ub97c \ub098\uc5f4\ud558\uc9c0 \ub9c8\uc2ed\uc2dc\uc624. \uc608\ub97c \ub4e4\uc5b4, "inetOrgPerson" \uac1d\uccb4\ub9cc \ub3d9\uae30\ud654\ud558\uace0 "inetOrgPerson"\uc758 \uc218\ud37c\ud074\ub798\uc2a4("person", "organizationalperson" \ubc0f "top")\ub294 \ud544\ud130\ub9c1\ud574\uc57c \ud558\ub294 \uacbd\uc6b0 "inetOrgPerson"\ub9cc \uc5ec\uae30\uc5d0 \ub098\uc5f4\ud558\uc2ed\uc2dc\uc624. LDAP\uc758 \ubaa8\ub4e0 \uac1d\uccb4\ub294 "top"\uc758 \ud558\uc704 \ud074\ub798\uc2a4\uac00 \ub429\ub2c8\ub2e4. \uc774\ub7ec\ud55c \uc774\uc720\ub85c \uc778\ud574 "top"\uc744 \ub098\uc5f4\ud558\uba74 \uc548 \ub429\ub2c8\ub2e4. \ub098\uc5f4\ud560 \uacbd\uc6b0 \uac1d\uccb4\uac00 \ud544\ud130\ub9c1\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
attributesToSynchronize.display=\ub3d9\uae30\ud654\ud560 \uc18d\uc131
attributesToSynchronize.help=\ub3d9\uae30\ud654\ud560 \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. \uba85\uba85\ub41c \uc18d\uc131\uc744 \uc5c5\ub370\uc774\ud2b8\ud558\uc9c0 \uc54a\ub294 \uacbd\uc6b0 \ubcc0\uacbd \ub85c\uadf8\ub85c\ubd80\ud130\uc758 \uc5c5\ub370\uc774\ud2b8\ub97c \ubb34\uc2dc\ud569\ub2c8\ub2e4. \uc608\ub97c \ub4e4\uc5b4 "department"\ub9cc \ub098\uc5f4\ub41c \uacbd\uc6b0 "department"\uc5d0 \uc601\ud5a5\uc744 \uc8fc\ub294 \ubcc0\uacbd \ub0b4\uc6a9\ub9cc \ucc98\ub9ac\ub429\ub2c8\ub2e4. \ub2e4\ub978 \uc5c5\ub370\uc774\ud2b8\ub294 \ubaa8\ub450 \ubb34\uc2dc\ub429\ub2c8\ub2e4. \ube44\uc6cc \ub450\uba74(\uae30\ubcf8\uac12) \ubaa8\ub4e0 \ubcc0\uacbd \ub0b4\uc6a9\uc774 \ucc98\ub9ac\ub429\ub2c8\ub2e4.
modifiersNamesToFilterOut.display=\ubcc0\uacbd \ub0b4\uc6a9 \ud544\ud130 \uae30\uc900
modifiersNamesToFilterOut.help=\ubcc0\uacbd \ub0b4\uc6a9\uc5d0\uc11c \ud544\ud130\ub9c1\ud560 \ub514\ub809\ud1a0\ub9ac \uad00\ub9ac\uc790\uc758 \uc774\ub984(DN)\uc785\ub2c8\ub2e4. \uc774 \ubaa9\ub85d\uc758 \ud56d\ubaa9\uacfc \uc77c\uce58\ud558\ub294 "modifiersName" \uc18d\uc131\uc774 \ud3ec\ud568\ub41c \ubcc0\uacbd \ub0b4\uc6a9\uc774 \ud544\ud130\ub9c1\ub429\ub2c8\ub2e4. \uc21c\ud658\uc744 \ubc29\uc9c0\ud558\uae30 \uc704\ud558\uc5ec \uae30\ubcf8 \uac12\uc740 \uc774 \uc5b4\ub311\ud130\uac00 \uc0ac\uc6a9\ud558\ub294 \uad00\ub9ac\uc790 \uc774\ub984\uc785\ub2c8\ub2e4. \ud56d\ubaa9\uc758 \ud615\uc2dd\uc740 "cn=Directory Manager"\uc5ec\uc57c \ud569\ub2c8\ub2e4.
accountSynchronizationFilter.display=\ub3d9\uae30\ud654\ud560 \uacc4\uc815\uc5d0 \ub300\ud55c LDAP \ud544\ud130
accountSynchronizationFilter.help=\ub3d9\uae30\ud654\ud560 \uac1d\uccb4\uc5d0 \ub300\ud55c \uc120\ud0dd\uc801 LDAP \ud544\ud130\uc785\ub2c8\ub2e4. \ubcc0\uacbd \ub85c\uadf8\ub294 \ubaa8\ub4e0 \uac1d\uccb4\uc5d0 \ub300\ud55c \uac83\uc774\uae30 \ub54c\ubb38\uc5d0 \uc774 \ud544\ud130\ub294 \uc9c0\uc815\ub41c \ud544\ud130\uc640 \uc77c\uce58\ud558\ub294 \uac1d\uccb4\ub9cc \uc5c5\ub370\uc774\ud2b8\ud569\ub2c8\ub2e4. \ud544\ud130\ub97c \uc9c0\uc815\ud558\uba74 \uac1d\uccb4\ub294 \ud544\ud130\uc640 \uc77c\uce58\ud558\ub294 \uacbd\uc6b0\uc5d0\ub9cc \ub3d9\uae30\ud654\ub418\uace0 \ub3d9\uae30\ud654\ub41c \uac1d\uccb4 \ud074\ub798\uc2a4\ub97c \ud3ec\ud568\ud569\ub2c8\ub2e4.
changeLogBlockSize.display=\ubcc0\uacbd \ub85c\uadf8 \ube14\ub85d \ud06c\uae30
changeLogBlockSize.help=\ucffc\ub9ac\ub2f9 \ubd88\ub7ec\uc62c \ubcc0\uacbd \ub85c\uadf8 \ud56d\ubaa9\uc758 \uc218\uc785\ub2c8\ub2e4.
changeNumberAttribute.display=\uc22b\uc790 \ubcc0\uacbd \uc18d\uc131
changeNumberAttribute.help=\ubcc0\uacbd \ub85c\uadf8 \ud56d\ubaa9\uc758 \uc22b\uc790 \ubcc0\uacbd \uc18d\uc131 \uc774\ub984\uc785\ub2c8\ub2e4.
filterWithOrInsteadOfAnd.display=And \ub300\uc2e0 Or\ub85c \ud544\ud130
filterWithOrInsteadOfAnd.help=\uc77c\ubc18\uc801\uc73c\ub85c \ubcc0\uacbd \ub85c\uadf8 \ud56d\ubaa9\uc744 \ubd88\ub7ec\uc62c \ub54c \uc0ac\uc6a9\ub418\ub294 \ud544\ud130\ub294 \ubcc0\uacbd \ud56d\ubaa9\uc758 \uac04\uaca9\uc744 \uac80\uc0c9\ud558\ub294 And \uae30\ubc18 \ud544\ud130\uc785\ub2c8\ub2e4. \uc774 \ub4f1\ub85d \uc815\ubcf4\ub97c \uc124\uc815\ud558\uba74 \ud544\ud130\uac00 \ub300\uc2e0 \ud544\uc218 \ubcc0\uacbd \uc22b\uc790\uac00 \ud568\uaed8 \uc9c0\uc815\ub41c Or\uac00 \ub429\ub2c8\ub2e4.
removeLogEntryObjectClassFromFilter.display=\ud544\ud130\uc5d0\uc11c \ub85c\uadf8 \ud56d\ubaa9 \uac1d\uccb4 \ud074\ub798\uc2a4 \uc81c\uac70
removeLogEntryObjectClassFromFilter.help=\uc774 \ub4f1\ub85d \uc815\ubcf4\ub97c \uc124\uc815\ud558\uba74(\uae30\ubcf8\uac12) \ubcc0\uacbd \ub85c\uadf8 \ud56d\ubaa9\uc744 \ubd88\ub7ec\uc62c \ub54c \uc0ac\uc6a9\ub418\ub294 \ud544\ud130\uc5d0 "changeLogEntry" \uac1d\uccb4 \ud074\ub798\uc2a4\uac00 \ud3ec\ud568\ub418\uc9c0 \uc54a\uc73c\ubbc0\ub85c \ubcc0\uacbd \ub85c\uadf8\uc758 \ub2e4\ub978 \uac1d\uccb4 \uc720\ud615 \ud56d\ubaa9\uc774 \uc5c6\uc5b4\uc9d1\ub2c8\ub2e4.
synchronizePasswords.display=\ube44\ubc00\ubc88\ud638 \ub3d9\uae30\ud654 \uc0ac\uc6a9
synchronizePasswords.help=true\ub85c \uc124\uc815\ud560 \uacbd\uc6b0 \ucee4\ub125\ud130\uac00 \ube44\ubc00\ubc88\ud638\ub97c \ub3d9\uae30\ud654\ud569\ub2c8\ub2e4. \ube44\ubc00\ubc88\ud638 \ub3d9\uae30\ud654\ub97c \uc0ac\uc6a9\ud558\ub824\uba74 \ube44\ubc00\ubc88\ud638 \ucea1\ucc98 \ud50c\ub7ec\uadf8\uc778\uc744 \uc124\uce58\ud574\uc57c \ud569\ub2c8\ub2e4.
passwordAttributeToSynchronize.display=\ub3d9\uae30\ud654\ud560 \ube44\ubc00\ubc88\ud638 \uc18d\uc131
passwordAttributeToSynchronize.help=\ube44\ubc00\ubc88\ud638 \ub3d9\uae30\ud654\ub97c \uc218\ud589\ud560 \ub54c \ub3d9\uae30\ud654\ud560 \ube44\ubc00\ubc88\ud638 \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4.
passwordDecryptionKey.display=\ube44\ubc00\ubc88\ud638 \ud574\ub3c5 \ud0a4
passwordDecryptionKey.help=\ube44\ubc00\ubc88\ud638 \ub3d9\uae30\ud654\ub97c \uc218\ud589\ud560 \ub54c \ube44\ubc00\ubc88\ud638\ub97c \ud574\ub3c5\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \ud0a4\uc785\ub2c8\ub2e4.
passwordDecryptionInitializationVector.display=\ube44\ubc00\ubc88\ud638 \ud574\ub3c5 \ucd08\uae30\ud654 \ubca1\ud130
passwordDecryptionInitializationVector.help=\ube44\ubc00\ubc88\ud638 \ub3d9\uae30\ud654\ub97c \uc218\ud589\ud560 \ub54c \ube44\ubc00\ubc88\ud638\ub97c \ud574\ub3c5\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \ucd08\uae30\ud654 \ubca1\ud130\uc785\ub2c8\ub2e4.

# Configuration properties validation.
host.notBlank=\ud638\uc2a4\ud2b8\ub294 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
port.legalValue=\ud3ec\ud2b8 \ubc88\ud638\ub294 0 - 65535 \uc0ac\uc774\uc5ec\uc57c \ud569\ub2c8\ub2e4.
baseContexts.notEmpty=\uae30\ubcf8 \ud14d\uc2a4\ud2b8 \ubaa9\ub85d\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
baseContexts.noBlankValues=\uae30\ubcf8 \ud14d\uc2a4\ud2b8 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
baseContexts.noInvalidLdapNames=\uae30\ubcf8 \ucee8\ud14d\uc2a4\ud2b8 {0}\uc740(\ub294) \uad6c\ubb38 \ubd84\uc11d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
passwordAttribute.notBlank=\ube44\ubc00\ubc88\ud638 \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
accountObjectClasses.notEmpty=\uacc4\uc815 \uac1d\uccb4 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
accountObjectClasses.noBlankValues=\uacc4\uc815 \uac1d\uccb4 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
accountUserNameAttributes.notEmpty=\uacc4\uc815 \uc0ac\uc6a9\uc790 \uc774\ub984 \uc18d\uc131 \ubaa9\ub85d\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
accountUserNameAttributes.noBlankValues=\uacc4\uc815 \uc0ac\uc6a9\uc790 \uc774\ub984 \uc18d\uc131 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
groupMemberAttribute.notBlank=\uadf8\ub8f9 \uad6c\uc131\uc6d0 \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
blockSize.legalValue=\ube14\ub85d \ud06c\uae30\ub294 0\ubcf4\ub2e4 \ucee4\uc57c \ud569\ub2c8\ub2e4.
vlvSortAttribute.notBlank=VLV \uc815\ub82c \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
uidAttribute.notBlank=UID\uc5d0 \ub9e4\ud551\ud560 \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
extendedObjectClasses.notBlank=\ud655\uc7a5 \uac1d\uccb4 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
readSchema.mustBeTrueWithExtendedObjectClasses=\ud655\uc7a5 \uac1d\uccb4 \ud074\ub798\uc2a4\ub97c \uc0ac\uc6a9\ud560 \ub54c\ub294 readSchema \ub4f1\ub85d \uc815\ubcf4\uac00 true\uc5ec\uc57c \ud569\ub2c8\ub2e4.
baseContextsToSynchronize.noBlankValues=\ub3d9\uae30\ud654\ud560 \uae30\ubcf8 \ud14d\uc2a4\ud2b8 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
baseContextsToSynchronize.noInvalidLdapNames=\ub3d9\uae30\ud638\ud654\ud560 \uae30\ubcf8 \ucee8\ud14d\uc2a4\ud2b8 {0}\uc740(\ub294) \uad6c\ubb38 \ubd84\uc11d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
objectClassesToSynchronize.notEmpty=\ub3d9\uae30\ud654\ud560 \uac1d\uccb4 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
objectClassesToSynchronize.noBlankValues=\ub3d9\uae30\ud654\ud560 \uac1d\uccb4 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
attributesToSynchronize.noBlankValues=\ub3d9\uae30\ud654\ud560 \uc18d\uc131 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
modifiersNamesToFilterOut.noBlankValues=\ud544\ud130\ub9c1\ud560 \uc218\uc815\uc790 \uc774\ub984 \ubaa9\ub85d\uc5d0\ub294 \ube48 \uac12\uc744 \ud3ec\ud568\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
modifiersNamesToFilterOut.noInvalidLdapNames={0}\uc744(\ub97c) \ud544\ud130\ub9c1\ud560 \uc218\uc815\uc790 \uc774\ub984\uc740 \uad6c\ubb38 \ubd84\uc11d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
changeNumberAttribute.notBlank=\uc22b\uc790 \ubcc0\uacbd \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
changeLogBlockSize.legalValue=\ub3d9\uae30\ud654 \ube14\ub85d \ud06c\uae30\ub294 0\ubcf4\ub2e4 \ucee4\uc57c \ud569\ub2c8\ub2e4.
passwordAttributeToSynchronize.notBlank=\ub3d9\uae30\ud654\ud560 \ube44\ubc00\ubc88\ud638 \uc18d\uc131\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
decryptionKey.notBlank=\ud574\ub3c5 \ud0a4\ub294 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
decryptionInitializationVector.notBlank=\ud574\ub3c5 \ucd08\uae30\ud654 \ubca1\ud130\ub294 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

entryNotFound="{0}" \ud56d\ubaa9\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
readingPasswordsNotSupported=\uac80\uc0c9 \uc791\uc5c5\uc5d0\uc11c \ube44\ubc00\ubc88\ud638\ub294 \ubc18\ud658\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.

memberAlreadyInGroup=\uad6c\uc131\uc6d0 "{0}"\uc740(\ub294) \uc774\ubbf8 "{1}" \uadf8\ub8f9\uc5d0 \uc788\uc2b5\ub2c8\ub2e4.
cannotRemoveBecausePosixMember=\uc0ac\uc6a9\uc790\uac00 POSIX \uadf8\ub8f9\uc758 \uad6c\uc131\uc6d0\uc778 \uacbd\uc6b0\uc5d0\ub294 "{0}" \uc18d\uc131\uc744 \uc81c\uac70\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
cannotAddToPosixGroup="{0}" \ud56d\ubaa9\uc740 "{1}" \uc18d\uc131\uc774 \uc5c6\uc73c\ubbc0\ub85c POSIX \uadf8\ub8f9\uc5d0 \ucd94\uac00\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

noUserMatched="{0}"\uc5d0 \uc77c\uce58\ud558\ub294 \uc0ac\uc6a9\uc790\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
authenticationFailed="{0}"\uc5d0 \ub300\ud55c \uc778\uc99d\uc774 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
moreThanOneUserMatched=\ub458 \uc774\uc0c1\uc758 \uc0ac\uc6a9\uc790\uac00 "{0}"\uc5d0 \uc77c\uce58\ud558\uc9c0\ub9cc \uc544\ubb34\ub3c4 \ube44\ubc00\ubc88\ud638\uac00 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
moreThanOneUserMatchedWithPassword=\ub458 \uc774\uc0c1\uc758 \uc0ac\uc6a9\uc790\uac00 "{0}"\uc5d0 \uc77c\uce58\ud558\uace0 \ub3d9\uc77c\ud55c \ube44\ubc00\ubc88\ud638\ub97c \uc0ac\uc6a9\ud558\uace0 \uc788\uc2b5\ub2c8\ub2e4.
