# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=LDAP-Connector

# Configuration properties.
host.display=Host
host.help=Der Name oder die IP-Adresse des Hosts, auf dem der LDAP-Server ausgef\u00fchrt wird.
port.display=TCP-Port
port.help=TCP/IP-Portnummer, der zur Kommunikation mit dem LDAP-Server verwendet wird.
ssl.display=SSL
ssl.help=Aktivieren Sie das Kontrollk\u00e4stchen, um beim Herstellung einer Verbindung zum LDAP-Server SSL zu verwenden.
failover.display=Failover-Server
failover.help=Z\u00e4hlen Sie alle Server auf, die bei einem Ausfall des bevorzugten Servers als Failover verwendet werden sollen. Wenn der bevorzugte Server ausf\u00e4llt, stellt JNDI eine Verbindung mit dem n\u00e4chsten verf\u00fcgbaren Server in der Liste her. Z\u00e4hlen Sie alle Server in dem Format "ldap://ldap.example.com:389/" auf, das den Standard-LDAP v3 URLs entspricht, die in RFC 2255 beschrieben sind. In dieser Einstellung sind nur die Host- und Port-Teile der URL relevant.
principal.display=Principal
principal.help=Der Distinguished Name (DN), mit dem eine Authentifizierung beim LDAP-Server durchgef\u00fchrt wird.
credentials.display=Passwort
credentials.help=Passwort f\u00fcr den Principal.
baseContexts.display=Basiskontexte
baseContexts.help=Ein oder mehrere Startpunkte im LDAP-Baum, die beim Durchsuchen der Baumstruktur verwendet werden. Suchabfragen werden durchgef\u00fchrt, wenn Benutzer vom LDAP-Server festgestellt werden oder wenn die Gruppen gesucht werden, zu denen ein Benutzer geh\u00f6rt.
passwordAttribute.display=Passwort-Attribut
passwordAttribute.help=Der Name des LDAP-Attributs, in dem das Passwort enthalten ist. Beim \u00c4ndern eines Benutzerpassworts wird das neue Passwort auf dieses Attribut gesetzt.
accountObjectClasses.display=Konto-Objektklassen
accountObjectClasses.help=Die Objektklasse bzw. die Objektklassen, die beim Erstellen von neuen Benutzerobjekten in der LDAP-Struktur verwendet werden. Wird mehr als eine Objektklasse eingegeben, sollte jeder Eintrag auf einer eigenen Zeile stehen. Verwenden Sie keine Kommata oder Semikolons, um mehrere Objektklassen voneinander zu trennen. Verwenden Sie keine Kommata oder Semikolons, um mehrere Objektklassen voneinander zu trennen. Einige Objektklassen erfordern, dass Sie alle Objektklassen in der Klassenhierarchie angeben.
accountUserNameAttributes.display=Konto-Benutzernamenattribute
accountUserNameAttributes.help=Attribut oder Attribute, in dem bzw. den der Benutzername f\u00fcr das Konto enthalten ist. Sie werden bei der Authentifizierung verwendet, um den LDAP-Eintrag f\u00fcr den zu authentifizierenden Benutzernamen zu suchen.
accountSearchFilter.display=LDAP-Filter f\u00fcr Kontoabruf
accountSearchFilter.help=Ein optionaler LDAP-Filter, mit dem gesteuert wird, welche Konten von der LDAP-Ressource zur\u00fcckgegeben werden. Wenn kein Filter angegeben wird, werden nur Konten zur\u00fcckgegeben, die s\u00e4mtliche angegebenen Objektklassen enthalten.
groupMemberAttribute.display=Gruppenmitglied-Attribut
groupMemberAttribute.help=Der Name des Gruppenattributs, das mit dem eindeutigen Namen des Benutzers aktualisiert wird, wenn dieser zur Gruppe hinzugef\u00fcgt wird.
maintainLdapGroupMembership.display=LDAP-Gruppenmitgliedschaft aufrecht erhalten
maintainLdapGroupMembership.help=Wenn diese Option aktiviert ist und ein Benutzer umbenannt oder gel\u00f6scht wird, aktualisieren Sie alle LDAP-Gruppen, denen der Benutzer angeh\u00f6rt, um den neuen Namen widerzuspiegeln. Anderenfalls muss die LDAP-Ressource die Bezugsintegrit\u00e4t hinsichtlich der Gruppenmitgliedschaft beibehalten.
maintainPosixGroupMembership.display=POSIX-Gruppenmitgliedschaft aufrecht erhalten
maintainPosixGroupMembership.help=Wenn diese Option aktiviert ist und ein Benutzer umbenannt oder gel\u00f6scht wird, aktualisieren Sie alle POSIX-Gruppen, denen der Benutzer angeh\u00f6rt, um den neuen Namen widerzuspiegeln. Anderenfalls muss die LDAP-Ressource die Bezugsintegrit\u00e4t hinsichtlich der Gruppenmitgliedschaft beibehalten.
passwordHashAlgorithm.display=Passwort-Hash-Algorithmus
passwordHashAlgorithm.help=Gibt den Algorithmus an, den das Identity System f\u00fcr das Passwort-Hash verwenden soll. Momentan werden die Werte SSHA, SHA, SMD5 und MD5 unterst\u00fctzt. Kein Wert zeigt an, dass das System kein Passwort-Hash durchf\u00fchrt. Dadurch werden Klartext-Passw\u00f6rter in LDAP gespeichert, au\u00dfer der LDAP-Server f\u00fchrt den Hash-Vorgang aus (bei Netscape Directory Server und iPlanet Directory Server ist das der Fall).
respectResourcePasswordPolicyChangeAfterReset.display=Ressourcen-Passwortrichtlinie '\u00c4nderung nach einem Reset' beachten
respectResourcePasswordPolicyChangeAfterReset.help=Wenn diese Ressource in einem Anmeldemodul angegeben ist (d.h., bei der Ressource handelt es sich um ein Pass-Through-Authentifizierungsziel) und die Passwortrichtlinie der Ressource eine '\u00c4nderung nach einem Reset' definiert, muss ein Benutzer, dessen Ressourcenkontopasswort von administrativer Seite zur\u00fcckgesetzt wurde, sein Passwort nach erfolgreicher Authentifizierung \u00e4ndern.
useBlocks.display=Bl\u00f6cke verwenden
useBlocks.help=Wenn Vorg\u00e4nge an vielen Konten durchgef\u00fchrt werden, werden die Konten in Bl\u00f6cken verarbeitet, um den von dem Vorgang verwendeten Arbeitsspeicher zu reduzieren. W\u00e4hlen Sie diese Option, um Konten in Bl\u00f6cken zu verarbeiten.
blockSize.display=Blockgr\u00f6\u00dfe
blockSize.help=Die maximale Anzahl an Konten, die beim Abrufen von Konten in Bl\u00f6cke in einem Block vorhanden sein k\u00f6nnen.
usePagedResultControl.display=Steuerung der ausgelagerten Ergebnisse verwenden
usePagedResultControl.help=Wenn diese Option aktiviert ist, wird beim Abrufen von Konten die LDAP-Steuerung der ausgelagerten Ergebnisse (LDAP Paged Results Control) anstelle der VLV-Steuerung verwendet.
vlvSortAttribute.display=Sortierattribut f\u00fcr VLV
vlvSortAttribute.help=Geben Sie das Sortierattribut f\u00fcr VLV-Indizes auf der Ressource an.
uidAttribute.display=UID-Attribut
uidAttribute.help=Der Name des LDAP-Attributs, das dem UID-Attribut zugeordnet wird.
readSchema.display=Schema lesen
readSchema.help=Ist diese Option auf true gesetzt, liest der Connector das Schema vom Server. Ist diese Option auf false gesetzt, stellt der Connector ein Standardschema bereit, das auf den Objektklassen in der Konfiguration basiert. Diese Eigenschaft muss auf true gesetzt sein, um die erweiterten Objektklassen nutzen zu k\u00f6nnen.
extendedObjectClasses.display=Erweiterte Objektklassen
extendedObjectClasses.help=Zus\u00e4tzliche Objektklassen, die im Schema bereitgestellt werden k\u00f6nnen. Wenn diese Eigenschaft nicht leer ist, muss die Eigenschaft "readSchema" auf true gesetzt sein.
baseContextsToSynchronize.display=Basiskontexte f\u00fcr Synchronisation
baseContextsToSynchronize.help=Ein oder mehrere Startpunkte im LDAP-Baum, anhand derer festgestellt wird, ob eine \u00c4nderung synchronisiert werden muss. Wenn diese Eigenschaft nicht gesetzt ist, wird das Attribut f\u00fcr die Basiskontexte zum Synchronisieren einer \u00c4nderung verwendet.
objectClassesToSynchronize.display=Zu synchronisierende Objektklassen
objectClassesToSynchronize.help=Die zu synchronisierenden Objektklassen. Das \u00c4nderungsprotokoll gilt f\u00fcr alle Objekte. Sie sollten die Superklassen einer Objektklasse nicht aufz\u00e4hlen, es sei denn, sie m\u00f6chten die Objekte mit einem der Superklassen-Werte synchronisieren. Angenommen, es sollen nur "inetOrgPerson"-Objekte synchronisiert und die Superklassen von "inetOrgPerson" ("person", "organizationalperson" und "top") herausgefiltert werden. In diesem Fall f\u00fchren Sie hier nur "inetOrgPerson" auf. Alle Objekte in LDAP sind Unterklassen von "top". Aus diesem Grund d\u00fcrfen Sie nie "top" angeben, anderenfalls w\u00fcrden keine Objekte gefiltert.
attributesToSynchronize.display=Zu synchronisierende Attribute
attributesToSynchronize.help=Die Namen der zu synchronisierenden Attribute. Dabei werden Aktualisierungen aus dem \u00c4nderungsprotokoll ignoriert, wenn sie keines der genannten Attribute aktualisieren. Wenn beispielsweise nur das Attribut f\u00fcr Abteilungen aufgef\u00fchrt ist, werden nur \u00c4nderungen verarbeitet, die sich auf dieses Attribut auswirken. Alle anderen Aktualisierungen werden ignoriert. Wenn das Feld leer ist (Standard), werden alle \u00c4nderungen verarbeitet.
modifiersNamesToFilterOut.display=\u00c4nderungen herausfiltern nach
modifiersNamesToFilterOut.help=Die Namen (DNs) der Verzeichnis-Administratoren, die aus den \u00c4nderungen herausgefiltert werden sollen. \u00c4nderungen mit dem Attribut "modifiersName", das Eintr\u00e4gen in dieser Liste entspricht, werden herausgefiltert. Der Standardwert ist der Administratorname, der von diesem Adapter zur Verhinderung von Schleifen verwendet wird. Die Eintr\u00e4ge m\u00fcssen das Format "cn=Directory Manager" aufweisen.
accountSynchronizationFilter.display=LDAP-Filter f\u00fcr zu synchronisierende Konten
accountSynchronizationFilter.help=Ein optionaler LDAP-Filter f\u00fcr die zu synchronisierenden Objekte. Da das \u00c4nderungsprotokoll f\u00fcr alle Objekte vorgesehen ist, aktualisiert dieser Filter nur Objekte, die mit dem angegebenen Filter \u00fcbereinstimmen. Wenn Sie einen Filter angeben, wird ein Objekt nur synchronisiert, wenn es mit dem Filter \u00fcbereinstimmt und eine synchronisierte Objektklasse einschlie\u00dft.
changeLogBlockSize.display=\u00c4nderungsprotokoll-Blockgr\u00f6\u00dfe
changeLogBlockSize.help=Die Anzahl der \u00c4nderungsprotokolleintr\u00e4ge, die pro Abfrage aufgerufen werden.
changeNumberAttribute.display=\u00c4nderungsnummerattribut
changeNumberAttribute.help=Das \u00c4nderungsnummerattribut im \u00c4nderungsprotokolleintrag.
filterWithOrInsteadOfAnd.display=Filtern mit Or anstelle von And
filterWithOrInsteadOfAnd.help=Normalerweise ist der Filter, der zum Abrufen von \u00c4nderungsprotokolleintr\u00e4gen verwendet wird, ein And-basierter Filter, der ein Intervall von \u00c4nderungseintr\u00e4gen abruft. Wenn diese Eigenschaft gesetzt ist, verwendet der Filter stattdessen eine Or-Bedingung, um die erforderlichen \u00c4nderungsnummern abzurufen.
removeLogEntryObjectClassFromFilter.display=\u00c4nderungseintrag-Objektklasse aus dem Filter entfernen
removeLogEntryObjectClassFromFilter.help=Wenn diese Eigenschaft gesetzt ist (die Standardeinstellung), enth\u00e4lt der zum Abrufen der \u00c4nderungsprotokolleintr\u00e4ge verwendete Filter die Objektklasse "changeLogEntry" nicht. Es wird erwartet, dass keine Eintr\u00e4ge anderer Objekttypen im \u00c4nderungsprotokoll vorhanden sind.
synchronizePasswords.display=Passwortsynchronisation aktivieren
synchronizePasswords.help=Ist diese Option auf true gesetzt, synchronisiert der Connector die Passw\u00f6rter. F\u00fcr die Passwortsynchronisation muss das Password Capture-Plugin installiert sein.
passwordAttributeToSynchronize.display=Zu synchronisierendes Passwortattribut
passwordAttributeToSynchronize.help=Der Name des Passwortattributs, das beim Ausf\u00fchren einer Passwortsynchronisation synchronisiert wird.
passwordDecryptionKey.display=Passwort-Entschl\u00fcsselungsschl\u00fcssel
passwordDecryptionKey.help=Der Schl\u00fcssel, der beim Ausf\u00fchren einer Passwortsynchronisation verwendet wird, um Passw\u00f6rter zu entschl\u00fcsseln.
passwordDecryptionInitializationVector.display=Initialisierungsvektor zur Passwortentschl\u00fcsselung
passwordDecryptionInitializationVector.help=Der Initialisierungsvektor, der beim Ausf\u00fchren einer Passwortsynchronisation verwendet wird, um Passw\u00f6rter zu entschl\u00fcsseln.

# Configuration properties validation.
host.notBlank=Der Host darf nicht leer sein
port.legalValue=Die Portnummer muss zwischen 0 und 65535 liegen
baseContexts.notEmpty=Die Liste der Basiskontexte darf nicht leer sein
baseContexts.noBlankValues=Die Liste der Basiskontexte darf keine leeren Werte enthalten
baseContexts.noInvalidLdapNames=Der Basiskontext {0} kann nicht analysiert werden
passwordAttribute.notBlank=Das Passwortattribut darf nicht leer sein
accountObjectClasses.notEmpty=Die Liste der Konto-Objektklassen darf nicht leer sein
accountObjectClasses.noBlankValues=Die Liste der Konto-Objektklassen darf keine leeren Werte enthalten
accountUserNameAttributes.notEmpty=Die Liste der Konto-Benutzernamenattribute darf nicht leer sein
accountUserNameAttributes.noBlankValues=Die Liste der Konto-Benutzernamenattribute darf keine leeren Werte enthalten
groupMemberAttribute.notBlank=Das Gruppenmitgliedattribut darf nicht leer sein
blockSize.legalValue=Die Block-Gr\u00f6\u00dfe muss gr\u00f6\u00dfer als 0 sein
vlvSortAttribute.notBlank=Das VLV-Sortierattribut darf nicht leer sein
uidAttribute.notBlank=Das zur UID zuzuordnende Attribut darf nicht leer sein
extendedObjectClasses.notBlank=Die Liste der erwarteten Objektklassen darf keine leeren Werte enthalten
readSchema.mustBeTrueWithExtendedObjectClasses=Die readSchema-Eigenschaft muss beim Verwenden erweiterter Objektklassen auf true gesetzt sein
baseContextsToSynchronize.noBlankValues=Die Liste der zu synchronisierenden Basiskontexte darf keine leeren Werte enthalten
baseContextsToSynchronize.noInvalidLdapNames=Der zu synchronisierende Basiskontext {0} kann nicht analysiert werden
objectClassesToSynchronize.notEmpty=Die Liste der zu synchronisierenden Objektklassen darf nicht leer sein
objectClassesToSynchronize.noBlankValues=Die Liste der zu synchronisierenden Objektklassen darf keine leeren Werte enthalten
attributesToSynchronize.noBlankValues=Die Liste der zu synchronisierenden Attribute darf keine leeren Werte enthalten
modifiersNamesToFilterOut.noBlankValues=Die Liste der herauszufilternden Modifizierernamen darf keine leeren Werte enthalten
modifiersNamesToFilterOut.noInvalidLdapNames=Der herauszufilternde Modifizierername {0} kann nicht analysiert werden
changeNumberAttribute.notBlank=Das \u00c4nderungsnummerattribut darf nicht leer sein
changeLogBlockSize.legalValue=Die Gr\u00f6\u00dfe des Synchronisationsblocks muss gr\u00f6\u00dfer als 0 sein
passwordAttributeToSynchronize.notBlank=Das zu synchronisierende Passwortattribut darf nicht leer sein
decryptionKey.notBlank=Der Entschl\u00fcsselungsschl\u00fcssel darf nicht leer sein
decryptionInitializationVector.notBlank=Der Initialisierungsvektor zur Entschl\u00fcsselung darf nicht leer sein

entryNotFound=Eintrag "{0}" nicht gefunden
readingPasswordsNotSupported=Die Wiedergabe von Passw\u00f6rtern \u00fcber einen Suchvorgang wird nicht unterst\u00fctzt

memberAlreadyInGroup=Das Mitglied "{0}" ist in der Gruppe "{1}" bereits vorhanden
cannotRemoveBecausePosixMember=Das Attribut "{0}" kann nicht entfernt werden, wenn der Benutzer ein Mitglied in POSIX-Gruppen ist
cannotAddToPosixGroup=Der Eintrag "{0}" kann POSIX-Gruppen nicht hinzugef\u00fcgt werden, da er nicht \u00fcber ein "{1}"-Attribut verf\u00fcgt

noUserMatched=Kein Benutzer entsprach "{0}"
authenticationFailed=Authentifizierung f\u00fcr "{0}" fehlgeschlagen
moreThanOneUserMatched=Mehrere Benutzer entsprachen "{0}", aber keiner hatte das richtige Passwort
moreThanOneUserMatchedWithPassword=Mehrere Benutzer entsprachen "{0}" und hatten das gleiche Passwort
