# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=Connecteur LDAP

# Configuration properties.
host.display=H\u00f4te
host.help=Nom ou adresse IP de l\u2019h\u00f4te sur lequel le serveur\u00a0LDAP est ex\u00e9cut\u00e9.
port.display=Port TCP
port.help=Num\u00e9ro du port TCP/IP utilis\u00e9 pour communiquer avec le serveur LDAP.
ssl.display=SSL
ssl.help=Cochez cette case pour \u00e9tablir une connexion avec le serveur LDAP via SSL.
failover.display=Serveurs de basculement
failover.help=Dressez la liste de tous les serveurs \u00e0 utiliser \u00e0 des fins de basculement en cas de panne du serveur favori. Ainsi, si le serveur favori tombe en panne, JNDI se connecte au prochain serveur disponible figurant sur cette liste. Dressez la liste des serveurs sous la forme ldap://ldap.exemple.com:389, laquelle suit la forme d\u2019URL LDAP v3 standard d\u00e9crite \u00e0 la section RFC 2255. Ce param\u00e8tre tient seulement compte des parties h\u00f4te et port de l\u2019URL.
principal.display=Principal
principal.help=Nom distinctif \u00e0 utiliser pour l\u2019authentification aupr\u00e8s du serveur LDAP.
credentials.display=Mot de passe
credentials.help=Mot de passe du principal.
baseContexts.display=Contextes de base
baseContexts.help=Un ou plusieurs des points de d\u00e9part dans l\u2019arborescence LDAP qui serviront lors des recherches dans l\u2019arborescence. Les recherches sont effectu\u00e9es lors de la d\u00e9tection des utilisateurs du serveur LDAP ou lors de la recherche des groupes dont un utilisateur est membre.
passwordAttribute.display=Attribut de mot de passe
passwordAttribute.help=Nom de l\u2019attribut LDAP contenant le mot de passe. Lors du changement du mot de passe d\u2019un utilisateur, le nouveau mot de passe est d\u00e9fini selon cet attribut.
accountObjectClasses.display=Classes d\u2019objet de compte
accountObjectClasses.help=Classes d\u2019objet utilis\u00e9es lors de la cr\u00e9ation d\u2019objets utilisateur dans l\u2019arborescence LDAP. Lors de la saisie de plusieurs classes d\u2019objet, chaque entr\u00e9e doit figurer sur sa propre ligne ; n\u2019utilisez pas de virgules ni de points-virgules pour s\u00e9parer les classes d\u2019objet multiples. Certaines classes d\u2019objet peuvent n\u00e9cessiter la sp\u00e9cification de toutes les classes d\u2019objet dans la hi\u00e9rarchie des classes.
accountUserNameAttributes.display=Attributs de nom d\u2019utilisateur de compte
accountUserNameAttributes.help=Attribut(s) stockant le nom d\u2019utilisateur du compte. Ces attributs sont utilis\u00e9s lors de l\u2019authentification afin de rechercher l\u2019entr\u00e9e LDAP correspondant au nom d\u2019utilisateur \u00e0 authentifier.
accountSearchFilter.display=Filtre LDAP pour la r\u00e9cup\u00e9ration de comptes
accountSearchFilter.help=Filtre LDAP facultatif permettant de contr\u00f4ler les comptes retourn\u00e9s\u00b7par la ressource LDAP. Si vous ne sp\u00e9cifiez aucun filtre, seuls les comptes comprenant toutes les classes d\u2019objet sp\u00e9cifi\u00e9es sont retourn\u00e9s.
groupMemberAttribute.display=Attribut de membre de groupe
groupMemberAttribute.help=Nom de l\u2019attribut de groupe qui sera mis \u00e0 jour avec le nom distinctif de l\u2019utilisateur lors de l\u2019ajout de l\u2019utilisateur au groupe.
maintainLdapGroupMembership.display=Maintenir l\u2019appartenance au groupe LDAP
maintainLdapGroupMembership.help=Lorsque cette option est activ\u00e9e et qu\u2019un utilisateur est renomm\u00e9 ou supprim\u00e9, les groupes LDAP auxquels l\u2019utilisateur appartient sont mis \u00e0 jour afin de refl\u00e9ter le nouveau nom. Sinon, la ressource LDAP doit maintenir l\u2019int\u00e9grit\u00e9 r\u00e9f\u00e9rentielle concernant l\u2019appartenance \u00e0 un groupe.
maintainPosixGroupMembership.display=Maintenir l\u2019appartenance au groupe POSIX
maintainPosixGroupMembership.help=Lorsque cette option est activ\u00e9e et qu\u2019un utilisateur est renomm\u00e9 ou supprim\u00e9, les groupes POSIX auxquels l\u2019utilisateur appartient sont mis \u00e0 jour afin de refl\u00e9ter le nouveau nom. Sinon, la ressource LDAP doit maintenir l\u2019int\u00e9grit\u00e9 r\u00e9f\u00e9rentielle concernant l\u2019appartenance \u00e0 un groupe.
passwordHashAlgorithm.display=Algorithme de hachage du mot de passe
passwordHashAlgorithm.help=Indique l\u2019algorithme qu\u2019Identity System doit utiliser pour hacher le mot de passe. Les valeurs prises en charge actuellement sont SSHA, SHA, SMD5 et MD5. Une valeur vide signifie que le syst\u00e8me ne hache pas les mots de passe. Ainsi, les mots de passe avec texte en clair seront stock\u00e9s dans LDAP si le serveur LDAP n\u2019effectue pas le hachage (Netscape Directory Server et le serveur iPlanet Directory l\u2019effectuent).
respectResourcePasswordPolicyChangeAfterReset.display=Respecter la strat\u00e9gie de mot de passe de la ressource Changement apr\u00e8s r\u00e9initialisation
respectResourcePasswordPolicyChangeAfterReset.help=Lorsque cette ressource est sp\u00e9cifi\u00e9e dans un module de connexion (c.-\u00e0-d., cette ressource est une cible d\u2019authentification d\u2019intercommunication) et que la strat\u00e9gie de mot de passe de la ressource est configur\u00e9e pour un changement apr\u00e8s r\u00e9initialisation, un utilisateur dont le mot de passe de compte de ressource a \u00e9t\u00e9 r\u00e9initialis\u00e9 par voie administrative est oblig\u00e9 de changer ce mot de passe apr\u00e8s son authentification.
useBlocks.display=Utiliser des blocs
useBlocks.help=Lors de l\u2019ex\u00e9cution d\u2019op\u00e9rations sur un grand nombre de comptes, les comptes sont trait\u00e9s par blocs pour diminuer la quantit\u00e9 de m\u00e9moire utilis\u00e9e par l\u2019op\u00e9ration. S\u00e9lectionnez cette option pour traiter les comptes par blocs.
blockSize.display=Taille de bloc
blockSize.help=Nombre maximum de comptes pouvant \u00eatre contenus dans un bloc lors de la r\u00e9cup\u00e9ration de comptes par blocs.
usePagedResultControl.display=Utiliser le contr\u00f4le des r\u00e9sultats pagin\u00e9s
usePagedResultControl.help=Lorsque cette option est activ\u00e9e, le contr\u00f4le des r\u00e9sultats pagin\u00e9s LDAP est pr\u00e9f\u00e9r\u00e9 au contr\u00f4le VLV dans le cadre de la r\u00e9cup\u00e9ration de comptes.
vlvSortAttribute.display=Attribut de tri VLV
vlvSortAttribute.help=Sp\u00e9cifiez l\u2019attribut de tri \u00e0 utiliser pour les index VLV sur la ressource.
uidAttribute.display=Attribut d\u2019UID
uidAttribute.help=Nom de l\u2019attribut LDAP mapp\u00e9 \u00e0 l\u2019attribut d\u2019UID.
readSchema.display=Lire le sch\u00e9ma
readSchema.help=Si cette propri\u00e9t\u00e9 est d\u00e9finie sur true, le connecteur lit le sch\u00e9ma \u00e0 partir du serveur. Si elle est d\u00e9finie sur false, le connecteur fournit un sch\u00e9ma par d\u00e9faut \u00e9tabli d\u2019apr\u00e8s les classes d\u2019objet de la configuration. Cette propri\u00e9t\u00e9 doit \u00eatre d\u00e9finie sur true afin d\u2019utiliser des classes d\u2019objet \u00e9tendues.
baseContextsToSynchronize.display=Contextes de base \u00e0 synchroniser
baseContextsToSynchronize.help=Un ou plusieurs points de d\u00e9part situ\u00e9s dans l\u2019arborescence LDAP servant \u00e0 d\u00e9terminer si une modification doit \u00eatre synchronis\u00e9e. L\u2019attribut des contextes de base est appliqu\u00e9 lors de la synchronisation d\u2019une modification si cette propri\u00e9t\u00e9 n\u2019est pas configur\u00e9e.
objectClassesToSynchronize.display=Classes d\u2019objet \u00e0 synchroniser
objectClassesToSynchronize.help=Classes d\u2019objet \u00e0 synchroniser. Le journal des modifications prend en compte tous les objets ; cette propri\u00e9t\u00e9 permet de filtrer les mises \u00e0 jour pour n\u2019obtenir que celles des classes d\u2019objet list\u00e9es. Vous ne devez pas recenser les superclasses d\u2019une classe d\u2019objet \u00e0 moins de vouloir synchroniser les objets avec n\u2019importe laquelle des valeurs de superclasse. Si, par exemple, seuls les objets de type inetOrgPerson ont besoin d\u2019\u00eatre synchronis\u00e9s mais que les superclasses d\u2019inetOrgPerson (person, organizationalperson et top) doivent \u00eatre \u00e9limin\u00e9es par filtrage, indiquez uniquement inetOrgPerson ici. Tous les objets de LDAP sont sous-class\u00e9s \u00e0 partir de top. C\u2019est pour cette raison que vous ne devriez jamais lister top ; sinon aucun objet ne serait filtr\u00e9.
attributesToSynchronize.display=Attributs \u00e0 synchroniser
attributesToSynchronize.help=Noms des attributs \u00e0 synchroniser. Cette option permet d\u2019ignorer les mises \u00e0 jour issues du journal des modifications qui ne concernent aucun des attributs nomm\u00e9s. Par exemple, si seul le service est r\u00e9pertori\u00e9, seules les modifications applicables \u00e0 ce service trait\u00e9es. Aucune autre mise \u00e0 jour n\u2019est prise en consid\u00e9ration. Si cette option est vide (par d\u00e9faut), toutes les modifications sont trait\u00e9es.
modifiersNamesToFilterOut.display=Filtrer les modifications par
modifiersNamesToFilterOut.help=Noms (DN) des administrateurs de r\u00e9pertoires \u00e0 filtrer des modifications. Les modifications poss\u00e9dant l\u2019attribut modifiersName correspondant aux entr\u00e9es de cette liste seront \u00e9limin\u00e9es par filtrage. La valeur standard est le nom d\u2019administrateur utilis\u00e9 par cet adaptateur, afin d\u2019\u00e9viter les boucles. Les entr\u00e9es devraient respecter le format cn=Gestionnaire de r\u00e9pertoires.
accountSynchronizationFilter.display=Filtre LDAP pour les comptes \u00e0 synchroniser
accountSynchronizationFilter.help=Filtre LDAP facultatif \u00e0 appliquer aux objets \u00e0 synchroniser. Comme le journal des modifications s\u2019applique \u00e0 tous les objets, ce filtre met \u00e0 jour uniquement les objets r\u00e9pondant exactement \u00e0 ses crit\u00e8res. Si vous sp\u00e9cifiez un filtre, un objet est synchronis\u00e9 uniquement s\u2019il correspond au filtre en question et comprend une classe d\u2019objet synchronis\u00e9e.
changeLogBlockSize.display=Taille de bloc du journal des modifications
changeLogBlockSize.help=Nombre d\u2019entr\u00e9es du journal des modifications \u00e0 extraire par requ\u00eate.
changeNumberAttribute.display=Attribut de num\u00e9ro\u00b7de modification
changeNumberAttribute.help=Nom de l\u2019attribut du num\u00e9ro de modification dans l\u2019entr\u00e9e du journal des modifications.
filterWithOrInsteadOfAnd.display=Filtrer avec Ou au lieu de Et
filterWithOrInsteadOfAnd.help=En g\u00e9n\u00e9ral, le filtre utilis\u00e9 pour extraire les entr\u00e9es du journal des modifications est un filtre de type Et r\u00e9cup\u00e9rant un intervalle d\u2019entr\u00e9es de modifications. Si cette propri\u00e9t\u00e9 est d\u00e9finie, le filtre applique \u00e0 la place la r\u00e8gle Ou pour recueillir les num\u00e9ros de modifications requises.
removeLogEntryObjectClassFromFilter.display=Supprimer la classe d\u2019objet des entr\u00e9es de journal du filtre
removeLogEntryObjectClassFromFilter.help=Si cette propri\u00e9t\u00e9 est d\u00e9finie (par d\u00e9faut), le filtre servant \u00e0 extraire les entr\u00e9es du journal des modifications ne contient pas la classe d\u2019objets changeLogEntry, pr\u00e9voyant qu\u2019aucune entr\u00e9e d\u2019autres types d\u2019objets ne figure dans le journal des modifications.
synchronizePasswords.display=Activer la synchronisation des mots de passe
synchronizePasswords.help=Si cette propri\u00e9t\u00e9 est d\u00e9finie sur true, le connecteur synchronise les mots de passe. Pour que la synchronisation des mots de passe fonctionne, v\u00e9rifiez que le plug-in Password Capture est install\u00e9.
passwordAttributeToSynchronize.display=Attribut de mot de passe \u00e0 synchroniser
passwordAttributeToSynchronize.help=Nom de l\u2019attribut de mot de passe \u00e0 synchroniser lors des op\u00e9rations de synchronisation des mots de passe.
passwordDecryptionKey.display=Cl\u00e9 de d\u00e9chiffrement des mots de passe
passwordDecryptionKey.help=Cl\u00e9 utilis\u00e9e pour d\u00e9chiffrer les mots de passe lors de la synchronisation de ces derniers.
passwordDecryptionInitializationVector.display=Vecteur d\u2019initialisation du d\u00e9chiffrement des mots de passe
passwordDecryptionInitializationVector.help=Vecteur d\u2019initialisation utilis\u00e9 pour d\u00e9chiffrer les mots de passe lors de la synchronisation de ces derniers.

# Configuration properties validation.
host.notBlank=L\u2019h\u00f4te doit \u00eatre sp\u00e9cifi\u00e9.
port.legalValue=Le num\u00e9ro du port doit \u00eatre compris entre 0 et 65 535.
baseContexts.notEmpty=La liste des contextes de base doit \u00eatre sp\u00e9cifi\u00e9e.
baseContexts.noBlankValues=La liste des contextes de base ne peut pas contenir de valeurs vides.
baseContexts.noInvalidLdapNames=Impossible d\u2019analyser le contexte de base {0}.
passwordAttribute.notBlank=L\u2019attribut de mot de passe doit \u00eatre sp\u00e9cifi\u00e9.
accountObjectClasses.notEmpty=La liste des classes d\u2019objet de comptes doit \u00eatre sp\u00e9cifi\u00e9e.
accountObjectClasses.noBlankValues=La liste des classes d\u2019objet de comptes ne peut pas contenir de valeurs vides.
accountUserNameAttributes.notEmpty=La liste des attributs de noms d\u2019utilisateur de comptes doit \u00eatre sp\u00e9cifi\u00e9e.
accountUserNameAttributes.noBlankValues=La liste des attributs de noms d\u2019utilisateur de comptes ne peut pas contenir de valeurs vides.
groupMemberAttribute.notBlank=L\u2019attribut de membre de groupe doit \u00eatre sp\u00e9cifi\u00e9.
blockSize.legalValue=La taille de bloc doit \u00eatre sup\u00e9rieure \u00e0 0.
vlvSortAttribute.notBlank=L\u2019attribut de tri VLV doit \u00eatre sp\u00e9cifi\u00e9.
uidAttribute.notBlank=L\u2019attribut \u00e0 mapper \u00e0 l\u2019UID doit \u00eatre sp\u00e9cifi\u00e9.
baseContextsToSynchronize.noBlankValues=La liste des contextes de base \u00e0 synchroniser ne peut pas contenir de valeurs vides.
baseContextsToSynchronize.noInvalidLdapNames=Impossible d\u2019analyser le contexte de base \u00e0 synchroniser {0}.
objectClassesToSynchronize.notEmpty=La liste des classes d\u2019objet \u00e0 synchroniser doit \u00eatre sp\u00e9cifi\u00e9e.
objectClassesToSynchronize.noBlankValues=La liste des classes d\u2019objet \u00e0 synchroniser ne peut pas contenir de valeurs vides.
attributesToSynchronize.noBlankValues=La liste des attributs \u00e0 synchroniser ne peut pas contenir de valeurs vides.
modifiersNamesToFilterOut.noBlankValues=La liste des noms de modificateurs \u00e0 \u00e9liminer par filtrage ne peut pas contenir de valeurs vides.
modifiersNamesToFilterOut.noInvalidLdapNames=Impossible d\u2019analyser le nom de modificateur \u00e0 \u00e9liminer par filtrage {0}.
changeNumberAttribute.notBlank=L\u2019attribut de num\u00e9ro de modification doit \u00eatre sp\u00e9cifi\u00e9.
changeLogBlockSize.legalValue=La taille de bloc de synchronisation doit \u00eatre sup\u00e9rieure \u00e0 0.
passwordAttributeToSynchronize.notBlank=L\u2019attribut de mot de passe \u00e0 synchroniser doit \u00eatre sp\u00e9cifi\u00e9.
decryptionKey.notBlank=La cl\u00e9 de d\u00e9chiffrement doit \u00eatre sp\u00e9cifi\u00e9e.
decryptionInitializationVector.notBlank=Le vecteur d\u2019initialisation de d\u00e9chiffrement doit \u00eatre sp\u00e9cifi\u00e9.

entryNotFound=L\u2019entr\u00e9e \u2019{0}\u2019 est introuvable.
readingPasswordsNotSupported=Le renvoi de mots de passe \u00e0 partir d\u2019une op\u00e9ration de recherche n\u2019est pas pris en charge.

memberAlreadyInGroup=Le membre \u2019{0}\u2019 existe d\u00e9j\u00e0 dans le groupe \u2019{1}\u2019.
cannotRemoveBecausePosixMember=Impossible de supprimer l\u2019attribut \u2019{0}\u2019 si l\u2019utilisateur est membre de groupes POSIX.
cannotAddToPosixGroup=Impossible d\u2019ajouter l\u2019entr\u00e9e \u2019{0}\u2019 aux groupes POSIX car elle ne contient pas d\u2019attribut \u2019{1}\u2019.

noUserMatched=Aucun utilisateur correspondant \u00e0 \u2019{0}\u2019.
authenticationFailed=\u00c9chec de l\u2019authentification pour \u2019{0}\u2019.
moreThanOneUserMatched=Plusieurs utilisateurs correspondent \u00e0 \u2019{0}\u2019, sans le m\u00eame mot de passe.
moreThanOneUserMatchedWithPassword=Plusieurs utilisateurs correspondent \u00e0 \u2019{0}\u2019, avec le m\u00eame mot de passe.
