# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=LDAP \u30b3\u30cd\u30af\u30bf

# Configuration properties.
host.display=\u30db\u30b9\u30c8
host.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u5b9f\u884c\u3059\u308b\u30db\u30b9\u30c8\u306e\u540d\u524d\u307e\u305f\u306f IP \u30a2\u30c9\u30ec\u30b9\u3002
port.display=TCP \u30dd\u30fc\u30c8
port.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3068\u306e\u901a\u4fe1\u306b\u4f7f\u7528\u3059\u308b TCP/IP \u30dd\u30fc\u30c8\u756a\u53f7\u3002
ssl.display=SSL
ssl.help=SSL \u3092\u4f7f\u7528\u3057\u3066 LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3059\u308b\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u30de\u30fc\u30af\u3092\u4ed8\u3051\u307e\u3059\u3002
failover.display=\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u30b5\u30fc\u30d0\u30fc
failover.help=\u512a\u5148\u30b5\u30fc\u30d0\u30fc\u306b\u969c\u5bb3\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u306b\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306b\u4f7f\u7528\u3059\u308b\u3001\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u30ea\u30b9\u30c8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002\u9078\u629e\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u306b\u969c\u5bb3\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u3001JNDI \u306f\u30ea\u30b9\u30c8\u5185\u306e\u6b21\u306e\u4f7f\u7528\u53ef\u80fd\u306a\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3057\u307e\u3059\u3002RFC 2255 \u3067\u898f\u5b9a\u3055\u308c\u305f\u6a19\u6e96 LDAP v3 URL \u306b\u5f93\u3063\u3066\u3001"ldap://ldap.example.com:389/" \u306e\u5f62\u5f0f\u3067\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002\u3053\u306e\u8a2d\u5b9a\u3067\u306f\u3001URL \u306e\u30db\u30b9\u30c8\u3068\u30dd\u30fc\u30c8\u90e8\u5206\u3060\u3051\u304c\u95a2\u9023\u3057\u307e\u3059\u3002
principal.display=\u4e3b\u4f53
principal.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3068\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u8b58\u5225\u540d\u3002
credentials.display=\u30d1\u30b9\u30ef\u30fc\u30c9
credentials.help=\u4e3b\u4f53\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
baseContexts.display=\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
baseContexts.help=\u30c4\u30ea\u30fc\u3092\u691c\u7d22\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528\u3059\u308b\u3001LDAP \u30c4\u30ea\u30fc\u5185\u306e 1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u958b\u59cb\u70b9\u3002\u691c\u7d22\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u3092 LDAP \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u691c\u7d22\u3059\u308b\u5834\u5408\u3084\u3001\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u305d\u306e\u30e1\u30f3\u30d0\u30fc\u306b\u306a\u3063\u3066\u3044\u308b\u30b0\u30eb\u30fc\u30d7\u3092\u63a2\u3059\u5834\u5408\u306b\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002
passwordAttribute.display=\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027
passwordAttribute.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u4fdd\u6301\u3057\u3066\u3044\u308b LDAP \u5c5e\u6027\u306e\u540d\u524d\u3002\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u3068\u304d\u306b\u3001\u3053\u306e\u5c5e\u6027\u306b\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
accountObjectClasses.display=\u30a2\u30ab\u30a6\u30f3\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9
accountObjectClasses.help=LDAP \u30c4\u30ea\u30fc\u306b\u65b0\u3057\u3044\u30e6\u30fc\u30b6\u30fc\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u30021 \u3064\u4ee5\u4e0a\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u5165\u529b\u3059\u308b\u5834\u5408\u3001\u5404\u30a8\u30f3\u30c8\u30ea\u306f\u5225\u306e\u884c\u306b\u306a\u3051\u308c\u3070\u3044\u3051\u307e\u305b\u3093\u3002\u8907\u6570\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u533a\u5207\u308b\u306e\u306b\u30ab\u30f3\u30de\u3084\u30bb\u30df\u30b3\u30ed\u30f3\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306b\u3088\u3063\u3066\u306f\u3001\u305d\u306e\u30af\u30e9\u30b9\u968e\u5c64\u306b\u542b\u307e\u308c\u308b\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
accountUserNameAttributes.display=\u30a2\u30ab\u30a6\u30f3\u30c8\u30e6\u30fc\u30b6\u30fc\u540d\u5c5e\u6027
accountUserNameAttributes.help=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u4fdd\u6301\u3059\u308b\u5c5e\u6027\u3002\u8a8d\u8a3c\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u306e LDAP \u30a8\u30f3\u30c8\u30ea\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u3001\u8a8d\u8a3c\u6642\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
accountSearchFilter.display=\u30a2\u30ab\u30a6\u30f3\u30c8\u53d6\u5f97\u7528 LDAP \u30d5\u30a3\u30eb\u30bf
accountSearchFilter.help=LDAP \u30ea\u30bd\u30fc\u30b9\u304b\u3089\u3069\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u8fd4\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3059\u308b\u3001\u30aa\u30d7\u30b7\u30e7\u30f3\u306e LDAP \u30d5\u30a3\u30eb\u30bf\u3002\u30d5\u30a3\u30eb\u30bf\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u6307\u5b9a\u3057\u305f\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u542b\u3080\u30a2\u30ab\u30a6\u30f3\u30c8\u3060\u3051\u304c\u8fd4\u3055\u308c\u307e\u3059\u3002
groupMemberAttribute.display=\u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u5c5e\u6027
groupMemberAttribute.help=\u30b0\u30eb\u30fc\u30d7\u3078\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u8ffd\u52a0\u6642\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u8b58\u5225\u540d\u306b\u3088\u3063\u3066\u66f4\u65b0\u3055\u308c\u308b\u30b0\u30eb\u30fc\u30d7\u5c5e\u6027\u306e\u540d\u524d\u3002
maintainLdapGroupMembership.display=LDAP \u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u306e\u7dad\u6301
maintainLdapGroupMembership.help=\u6709\u52b9\u306a\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u5c5e\u3059\u308b LDAP \u30b0\u30eb\u30fc\u30d7\u304c\u66f4\u65b0\u3055\u308c\u3001\u65b0\u3057\u3044\u540d\u524d\u304c\u53cd\u6620\u3055\u308c\u307e\u3059\u3002\u6709\u52b9\u3067\u306a\u3044\u5834\u5408\u3001LDAP \u30ea\u30bd\u30fc\u30b9\u306f\u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u306b\u5bfe\u3057\u3066\u53c2\u7167\u7528\u306e\u5b8c\u5168\u6027\u3092\u7dad\u6301\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
maintainPosixGroupMembership.display=POSIX \u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u306e\u7dad\u6301
maintainPosixGroupMembership.help=\u6709\u52b9\u306a\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u524a\u9664\u3059\u308b\u3068\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u5c5e\u3059\u308b POSIX \u30b0\u30eb\u30fc\u30d7\u304c\u66f4\u65b0\u3055\u308c\u3001\u65b0\u3057\u3044\u540d\u524d\u304c\u53cd\u6620\u3055\u308c\u307e\u3059\u3002\u6709\u52b9\u3067\u306a\u3044\u5834\u5408\u3001LDAP \u30ea\u30bd\u30fc\u30b9\u306f\u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u306b\u5bfe\u3057\u3066\u53c2\u7167\u7528\u306e\u5b8c\u5168\u6027\u3092\u7dad\u6301\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
passwordHashAlgorithm.display=\u30d1\u30b9\u30ef\u30fc\u30c9\u30cf\u30c3\u30b7\u30e5\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
passwordHashAlgorithm.help=Identity \u30b7\u30b9\u30c6\u30e0\u304c\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30cf\u30c3\u30b7\u30e5\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u793a\u3057\u307e\u3059\u3002\u73fe\u5728\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f\u3001SSHA\u3001SHA\u3001SMD5\u3001\u304a\u3088\u3073 MD5 \u3067\u3059\u3002\u5024\u3092\u7a7a\u306b\u3059\u308b\u3068\u3001\u30b7\u30b9\u30c6\u30e0\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30cf\u30c3\u30b7\u30e5\u3057\u307e\u305b\u3093\u3002\u3053\u306e\u5834\u5408\u3001\u30cf\u30c3\u30b7\u30e5\u3092\u884c\u3046 LDAP \u30b5\u30fc\u30d0\u30fc\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u4ee5\u5916\u3067\u306f (Netscape Directory Server \u304a\u3088\u3073 iPlanet Directory \u30b5\u30fc\u30d0\u30fc\u306f\u30cf\u30c3\u30b7\u30e5\u3092\u304a\u3053\u306a\u3044\u307e\u3059)\u3001LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5e73\u6587\u3067\u4fdd\u5b58\u3055\u308c\u3066\u3057\u307e\u3044\u307e\u3059\u3002
respectResourcePasswordPolicyChangeAfterReset.display=\u30ea\u30bd\u30fc\u30b9\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306e\u30ea\u30bb\u30c3\u30c8\u5f8c\u306e\u5909\u66f4\u306b\u3064\u3044\u3066
respectResourcePasswordPolicyChangeAfterReset.help=\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u30ed\u30b0\u30a4\u30f3\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u6307\u5b9a\u3057 (\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u304c\u30d1\u30b9\u30b9\u30eb\u30fc\u8a8d\u8a3c\u306e\u5bfe\u8c61)\u3001\u30ea\u30bd\u30fc\u30b9\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u3092\u30ea\u30bb\u30c3\u30c8\u5f8c\u306b\u5909\u66f4\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3059\u308b\u3068\u3001\u30ea\u30bd\u30fc\u30b9\u30a2\u30ab\u30a6\u30f3\u30c8\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7ba1\u7406\u4e0a\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306f\u3001\u8a8d\u8a3c\u306b\u6210\u529f\u3057\u305f\u3042\u3068\u3067\u305d\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
useBlocks.display=\u30d6\u30ed\u30c3\u30af\u3092\u4f7f\u7528
useBlocks.help=\u591a\u6570\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306b\u5bfe\u3057\u3066\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u5834\u5408\u3001\u64cd\u4f5c\u3067\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30e2\u30ea\u91cf\u3092\u7bc0\u7d04\u3059\u308b\u305f\u3081\u306b\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30d6\u30ed\u30c3\u30af\u5358\u4f4d\u3067\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30d6\u30ed\u30c3\u30af\u5358\u4f4d\u3067\u51e6\u7406\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3057\u307e\u3059\u3002
blockSize.display=\u30d6\u30ed\u30c3\u30af\u30b5\u30a4\u30ba
blockSize.help=\u30d6\u30ed\u30c3\u30af\u5358\u4f4d\u3067\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u53d6\u5f97\u3059\u308b\u3068\u304d\u306e\u30011 \u30d6\u30ed\u30c3\u30af\u4e2d\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u6700\u5927\u6570\u3002
usePagedResultControl.display=Paged Results Control \u306e\u4f7f\u7528
usePagedResultControl.help=\u6709\u52b9\u306a\u5834\u5408\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u53d6\u5f97\u3059\u308b\u3068\u304d\u306b\u3001VLV \u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3088\u308a\u3082 LDAP Paged Results \u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u304c\u512a\u5148\u3055\u308c\u307e\u3059\u3002
vlvSortAttribute.display=VLV \u4e26\u3079\u66ff\u3048\u5c5e\u6027
vlvSortAttribute.help=\u30ea\u30bd\u30fc\u30b9\u306e VLV \u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u306b\u4f7f\u7528\u3059\u308b\u3001\u4e26\u3079\u66ff\u3048\u5c5e\u6027\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
uidAttribute.display=UID \u5c5e\u6027
uidAttribute.help=UID \u5c5e\u6027\u306b\u30de\u30c3\u30d7\u3055\u308c\u308b LDAP \u5c5e\u6027\u306e\u540d\u524d\u3002
readSchema.display=\u30b9\u30ad\u30fc\u30de\u306e\u8aad\u307f\u53d6\u308a
readSchema.help=true \u306e\u5834\u5408\u3001\u30b3\u30cd\u30af\u30bf\u306f\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30b9\u30ad\u30fc\u30de\u3092\u8aad\u307f\u53d6\u308a\u307e\u3059\u3002false \u306e\u5834\u5408\u3001\u30b3\u30cd\u30af\u30bf\u306f\u8a2d\u5b9a\u5185\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306b\u57fa\u3065\u3044\u3066\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30b9\u30ad\u30fc\u30de\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u62e1\u5f35\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092 true \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
baseContextsToSynchronize.display=\u540c\u671f\u3059\u308b\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
baseContextsToSynchronize.help=\u5909\u66f4\u3092\u540c\u671f\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6c7a\u5b9a\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528\u3055\u308c\u308b\u3001LDAP \u30c4\u30ea\u30fc\u5185\u306e 1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u958b\u59cb\u70b9\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u5909\u66f4\u3092\u540c\u671f\u3059\u308b\u305f\u3081\u306b\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u5c5e\u6027\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
objectClassesToSynchronize.display=\u540c\u671f\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9
objectClassesToSynchronize.help=\u540c\u671f\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3002\u5909\u66f4\u30ed\u30b0\u306f\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3057\u3066\u3067\u3059\u304c\u3001\u3053\u306e\u30d5\u30a3\u30eb\u30bf\u306f\u3001\u3053\u3053\u3067\u30ea\u30b9\u30c8\u3055\u308c\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u307f\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002\u30b9\u30fc\u30d1\u30fc\u30af\u30e9\u30b9\u306e\u5024\u3068\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u540c\u671f\u3059\u308b\u5834\u5408\u3092\u9664\u3044\u3066\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u30b9\u30fc\u30d1\u30fc\u30af\u30e9\u30b9\u3092\u6307\u5b9a\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u305f\u3068\u3048\u3070\u3001"inetOrgPerson" \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3060\u3051\u3092\u540c\u671f\u3057\u3001"inetOrgPerson" \u306e\u30b9\u30fc\u30d1\u30fc\u30af\u30e9\u30b9 ("person"\u3001"organizationalperson"\u3001\u304a\u3088\u3073 "top") \u3092\u540c\u671f\u3057\u306a\u3044\u5834\u5408\u306f\u3001"inetOrgPerson" \u3060\u3051\u3092\u3053\u3053\u306b\u6307\u5b9a\u3057\u307e\u3059\u3002LDAP \u306e\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3001"top" \u306e\u30b5\u30d6\u30af\u30e9\u30b9\u3067\u3059\u3002\u3057\u305f\u304c\u3063\u3066\u3001"top" \u306f\u6307\u5b9a\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002\u6307\u5b9a\u3059\u308b\u3068\u3001\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u540c\u671f\u3055\u308c\u307e\u3059\u3002
attributesToSynchronize.display=\u540c\u671f\u3059\u308b\u5c5e\u6027
attributesToSynchronize.help=\u540c\u671f\u3059\u308b\u5c5e\u6027\u306e\u540d\u524d\u3002\u5909\u66f4\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u306e\u66f4\u65b0\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u3092\u66f4\u65b0\u3057\u306a\u3044\u5834\u5408\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u300c\u90e8\u7f72\u300d\u3060\u3051\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u300c\u90e8\u7f72\u300d\u306b\u5f71\u97ff\u3059\u308b\u5909\u66f4\u3060\u3051\u304c\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u305d\u306e\u4ed6\u306e\u66f4\u65b0\u306f\u3059\u3079\u3066\u7121\u8996\u3055\u308c\u307e\u3059\u3002\u7a7a\u306e\u5834\u5408 (\u30c7\u30d5\u30a9\u30eb\u30c8) \u306f\u3001\u3059\u3079\u3066\u306e\u5909\u66f4\u304c\u51e6\u7406\u3055\u308c\u307e\u3059\u3002
modifiersNamesToFilterOut.display=\u9664\u5916\u3059\u308b\u5909\u66f4\u8005
modifiersNamesToFilterOut.help=\u5909\u66f4\u304b\u3089\u9664\u5916\u3059\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u7ba1\u7406\u8005\u306e\u540d\u524d (DN)\u3002\u5c5e\u6027 "modifiersName" \u304c\u3053\u306e\u30ea\u30b9\u30c8\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u4e00\u81f4\u3059\u308b\u5909\u66f4\u306f\u9664\u5916\u3055\u308c\u307e\u3059\u3002\u6a19\u6e96\u5024\u306f\u3001\u30eb\u30fc\u30d7\u3092\u9632\u3050\u305f\u3081\u3001\u3053\u306e\u30a2\u30c0\u30d7\u30bf\u306b\u3088\u308a\u4f7f\u7528\u3055\u308c\u308b\u7ba1\u7406\u8005\u540d\u3067\u3059\u3002\u30a8\u30f3\u30c8\u30ea\u306f\u3001"cn=Directory Manager" \u306e\u5f62\u5f0f\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
accountSynchronizationFilter.display=\u540c\u671f\u3055\u305b\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u306e LDAP \u30d5\u30a3\u30eb\u30bf
accountSynchronizationFilter.help=\u540c\u671f\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u30aa\u30d7\u30b7\u30e7\u30f3\u306e LDAP \u30d5\u30a3\u30eb\u30bf\u3067\u3059\u3002\u5909\u66f4\u30ed\u30b0\u306f\u3059\u3079\u3066\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u5bfe\u8c61\u3068\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u306e\u30d5\u30a3\u30eb\u30bf\u306f\u3001\u6307\u5b9a\u306e\u30d5\u30a3\u30eb\u30bf\u3068\u4e00\u81f4\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u307f\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002\u30d5\u30a3\u30eb\u30bf\u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u3001\u30d5\u30a3\u30eb\u30bf\u3068\u4e00\u81f4\u3057\u3001\u540c\u671f\u3055\u308c\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u542b\u3080\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3060\u3051\u304c\u540c\u671f\u3055\u308c\u307e\u3059\u3002
changeLogBlockSize.display=\u5909\u66f4\u30ed\u30b0\u306e\u30d6\u30ed\u30c3\u30af\u30b5\u30a4\u30ba
changeLogBlockSize.help=1 \u3064\u306e\u30af\u30a8\u30ea\u30fc\u3067\u30d5\u30a7\u30c3\u30c1\u3059\u308b\u5909\u66f4\u30ed\u30b0\u306e\u30a8\u30f3\u30c8\u30ea\u6570\u3002
changeNumberAttribute.display=\u5909\u66f4\u756a\u53f7\u5c5e\u6027
changeNumberAttribute.help=\u5909\u66f4\u30ed\u30b0\u30a8\u30f3\u30c8\u30ea\u306e\u5909\u66f4\u756a\u53f7\u5c5e\u6027\u306e\u540d\u524d\u3002
filterWithOrInsteadOfAnd.display=AND \u306e\u4ee3\u308f\u308a\u306b OR \u3067\u30d5\u30a3\u30eb\u30bf\u3092\u9069\u7528
filterWithOrInsteadOfAnd.help=\u901a\u5e38\u3001\u5909\u66f4\u30ed\u30b0\u30a8\u30f3\u30c8\u30ea\u306e\u30d5\u30a7\u30c3\u30c1\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d5\u30a3\u30eb\u30bf\u306f AND \u30d9\u30fc\u30b9\u306e\u30d5\u30a3\u30eb\u30bf\u3067\u3001\u5909\u66f4\u30a8\u30f3\u30c8\u30ea\u306e\u9593\u9694\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u3068\u3001\u30d5\u30a3\u30eb\u30bf\u306f\u5fc5\u8981\u306a\u5909\u66f4\u756a\u53f7\u3092 OR \u3067\u53ce\u96c6\u3057\u307e\u3059\u3002
removeLogEntryObjectClassFromFilter.display=\u30d5\u30a3\u30eb\u30bf\u304b\u3089\u30ed\u30b0\u30a8\u30f3\u30c8\u30ea\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u524a\u9664
removeLogEntryObjectClassFromFilter.help=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u3068 (\u30c7\u30d5\u30a9\u30eb\u30c8)\u3001\u5909\u66f4\u30ed\u30b0\u306b\u4ed6\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30bf\u30a4\u30d7\u306e\u30a8\u30f3\u30c8\u30ea\u304c\u5b58\u5728\u3057\u306a\u3044\u3068\u898b\u306a\u3057\u3066\u3001\u5909\u66f4\u30ed\u30b0\u30a8\u30f3\u30c8\u30ea\u306e\u30d5\u30a7\u30c3\u30c1\u306b\u4f7f\u7528\u3059\u308b\u30d5\u30a3\u30eb\u30bf\u306b "changeLogEntry" \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u542b\u307f\u307e\u305b\u3093\u3002
synchronizePasswords.display=\u30d1\u30b9\u30ef\u30fc\u30c9\u540c\u671f\u306e\u6709\u52b9\u5316
synchronizePasswords.help=true \u306e\u5834\u5408\u3001\u30b3\u30cd\u30af\u30bf\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u540c\u671f\u3057\u307e\u3059\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u540c\u671f\u3092\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30ad\u30e3\u30d7\u30c1\u30e3\u30fc\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
passwordAttributeToSynchronize.display=\u540c\u671f\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027
passwordAttributeToSynchronize.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u540c\u671f\u3092\u5b9f\u884c\u3059\u308b\u3068\u304d\u306b\u3001\u540c\u671f\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306e\u540d\u524d\u3002
passwordDecryptionKey.display=\u30d1\u30b9\u30ef\u30fc\u30c9\u5fa9\u53f7\u5316\u30ad\u30fc
passwordDecryptionKey.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u540c\u671f\u3092\u5b9f\u884c\u3059\u308b\u3068\u304d\u306b\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8907\u5408\u5316\u3059\u308b\u305f\u3081\u306e\u30ad\u30fc\u3002
passwordDecryptionInitializationVector.display=\u30d1\u30b9\u30ef\u30fc\u30c9\u5fa9\u53f7\u5316\u306e\u521d\u671f\u5316\u30d9\u30af\u30c8\u30eb
passwordDecryptionInitializationVector.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u540c\u671f\u3092\u5b9f\u884c\u3059\u308b\u3068\u304d\u306b\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5fa9\u53f7\u5316\u3059\u308b\u305f\u3081\u306e\u521d\u671f\u5316\u30d9\u30af\u30c8\u30eb\u3002

# Configuration properties validation.
host.notBlank=\u30db\u30b9\u30c8\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
port.legalValue=\u30dd\u30fc\u30c8\u756a\u53f7\u306f 0 \uff5e 65535 \u306b\u3057\u3066\u304f\u3060\u3055\u3044
baseContexts.notEmpty=\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u30ea\u30b9\u30c8\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
baseContexts.noBlankValues=\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
baseContexts.noInvalidLdapNames=\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 {0} \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093
passwordAttribute.notBlank=\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
accountObjectClasses.notEmpty=\u30a2\u30ab\u30a6\u30f3\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
accountObjectClasses.noBlankValues=\u30a2\u30ab\u30a6\u30f3\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
accountUserNameAttributes.notEmpty=\u30a2\u30ab\u30a6\u30f3\u30c8\u30e6\u30fc\u30b6\u30fc\u540d\u5c5e\u6027\u306e\u30ea\u30b9\u30c8\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
accountUserNameAttributes.noBlankValues=\u30a2\u30ab\u30a6\u30f3\u30c8\u30e6\u30fc\u30b6\u30fc\u540d\u5c5e\u6027\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
groupMemberAttribute.notBlank=\u30b0\u30eb\u30fc\u30d7\u30e1\u30f3\u30d0\u30fc\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
blockSize.legalValue=\u30d6\u30ed\u30c3\u30af\u30b5\u30a4\u30ba\u306f 0 \u3088\u308a\u5927\u304d\u3044\u5024\u306b\u3057\u3066\u304f\u3060\u3055\u3044
vlvSortAttribute.notBlank=VLV \u4e26\u3079\u66ff\u3048\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
uidAttribute.notBlank=UID \u306b\u30de\u30c3\u30d7\u3059\u308b\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
baseContextsToSynchronize.noBlankValues=\u540c\u671f\u3059\u308b\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
baseContextsToSynchronize.noInvalidLdapNames=\u540c\u671f\u3059\u308b\u30d9\u30fc\u30b9\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 {0} \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093
objectClassesToSynchronize.notEmpty=\u540c\u671f\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
objectClassesToSynchronize.noBlankValues=\u540c\u671f\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
attributesToSynchronize.noBlankValues=\u540c\u671f\u3059\u308b\u5c5e\u6027\u306e\u30ea\u30b9\u30c8\u306b\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
modifiersNamesToFilterOut.noBlankValues=\u30d5\u30a3\u30eb\u30bf\u3067\u9664\u5916\u3059\u308b\u5909\u66f4\u8005\u306e\u540d\u524d\u306e\u30ea\u30b9\u30c8\u306b\u3001\u7a7a\u306e\u5024\u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
modifiersNamesToFilterOut.noInvalidLdapNames=\u30d5\u30a3\u30eb\u30bf\u3067\u9664\u5916\u3059\u308b\u5909\u66f4\u8005\u306e\u540d\u524d {0} \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093
changeNumberAttribute.notBlank=\u5909\u66f4\u756a\u53f7\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
changeLogBlockSize.legalValue=\u540c\u671f\u30d6\u30ed\u30c3\u30af\u30b5\u30a4\u30ba\u306f 0 \u3088\u308a\u5927\u304d\u3044\u5024\u306b\u3057\u3066\u304f\u3060\u3055\u3044
passwordAttributeToSynchronize.notBlank=\u540c\u671f\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
decryptionKey.notBlank=\u5fa9\u53f7\u5316\u30ad\u30fc\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
decryptionInitializationVector.notBlank=\u5fa9\u53f7\u5316\u306e\u521d\u671f\u5316\u30d9\u30af\u30c8\u30eb\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093

entryNotFound=\u30a8\u30f3\u30c8\u30ea "{0}" \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
readingPasswordsNotSupported=\u691c\u7d22\u51e6\u7406\u304b\u3089\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8fd4\u3059\u64cd\u4f5c\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093

memberAlreadyInGroup=\u30e1\u30f3\u30d0\u30fc "{0}" \u306f\u3059\u3067\u306b\u30b0\u30eb\u30fc\u30d7 "{1}" \u306b\u5b58\u5728\u3057\u307e\u3059
cannotRemoveBecausePosixMember=\u30e6\u30fc\u30b6\u30fc\u304c POSIX \u30b0\u30eb\u30fc\u30d7\u306e\u30e1\u30f3\u30d0\u30fc\u3067\u3042\u308b\u5834\u5408\u3001"{0}" \u5c5e\u6027\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093
cannotAddToPosixGroup=\u30a8\u30f3\u30c8\u30ea "{0}" \u306f\u3001"{1}" \u5c5e\u6027\u304c\u306a\u3044\u305f\u3081 POSIX \u30b0\u30eb\u30fc\u30d7\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093

noUserMatched="{0}" \u306b\u4e00\u81f4\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306f\u5b58\u5728\u3057\u307e\u305b\u3093
authenticationFailed="{0}" \u306e\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f
moreThanOneUserMatched=\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u304c "{0}" \u306b\u4e00\u81f4\u3057\u307e\u3057\u305f\u304c\u3001\u3044\u305a\u308c\u3082\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093
moreThanOneUserMatchedWithPassword=\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u304c "{0}" \u306b\u4e00\u81f4\u3057\u3001\u305d\u308c\u3089\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u540c\u3058\u3067\u3059
