# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb\u30b3\u30cd\u30af\u30bf

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=\u540d\u524d\u306e\u5f15\u7528
QUOTING_HELP=<b>\u540d\u524d\u306e\u5f15\u7528</b><br>\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u5217\u540d\u3092\u5f15\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3001\u304a\u3088\u3073\u305d\u306e\u5f15\u7528\u7b26\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u5217\u540d\u306f\u5f15\u7528\u3055\u308c\u307e\u305b\u3093 (\u300cNone\u300d)\u3002\u305d\u308c\u4ee5\u5916 (\u300cSingle\u300d\u3001\u300cDouble\u300d\u3001\u300cBack\u300d\u3001\u307e\u305f\u306f\u300cBrackets\u300d) \u3092\u9078\u629e\u3057\u305f\u5834\u5408\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u751f\u6210\u3055\u308c\u308b SQL \u4e2d\u306b\u3001\u5358\u4e00\u5f15\u7528\u7b26\u3001\u4e8c\u91cd\u5f15\u7528\u7b26\u3001\u9006\u5f15\u7528\u7b26\u3001\u307e\u305f\u306f\u89d2\u62ec\u5f27\u3067\u56f2\u3093\u3060\u5217\u540d\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
HOST_DISPLAY=\u30db\u30b9\u30c8
HOST_HELP=<b>\u30db\u30b9\u30c8</b><br>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u30db\u30b9\u30c8\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PORT_DISPLAY=\u30dd\u30fc\u30c8
PORT_HELP=<b>TCP \u30dd\u30fc\u30c8</b><br>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u304c\u5f85\u6a5f\u3059\u308b\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u5165\u529b\u3057\u307e\u3059\u3002
USER_DISPLAY=\u30e6\u30fc\u30b6\u30fc
USER_HELP=<b>\u30e6\u30fc\u30b6\u30fc</b><br>\u30a2\u30ab\u30a6\u30f3\u30c8\u30c6\u30fc\u30d6\u30eb\u306e\u30a2\u30af\u30bb\u30b9\u6a29\u3092\u6301\u3064\u3001\u5fc5\u9808\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u307e\u3059\u3002
PASSWORD_DISPLAY=\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
PASSWORD_HELP=<b>\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9</b><br>\u30a2\u30ab\u30a6\u30f3\u30c8\u30c6\u30fc\u30d6\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u6a29\u9650\u3092\u6301\u3064\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u5165\u529b\u3057\u307e\u3059\u3002
DATABASE_DISPLAY=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9
DATABASE_HELP=<b>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9</b><br>\u30c6\u30fc\u30d6\u30eb\u304c\u3042\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u307e\u3059\u3002
TABLE_DISPLAY=\u30c6\u30fc\u30d6\u30eb
TABLE_HELP=<b>\u30c6\u30fc\u30d6\u30eb</b><br>\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u542b\u3080\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u4e2d\u306e\u30c6\u30fc\u30d6\u30eb\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u307e\u3059\u3002
KEY_COLUMN_DISPLAY=\u30ad\u30fc\u5217
KEY_COLUMN_HELP=<b>\u30ad\u30fc\u5217</b><br>\u3053\u306e\u5fc5\u9808\u5217\u306e\u5024\u306f\u3001\u30c6\u30fc\u30d6\u30eb\u5185\u306e\u884c\u3092\u4e00\u610f\u306b\u8868\u3059\u8b58\u5225\u5b50\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002<br>
PASSWORD_COLUMN_DISPLAY=\u30d1\u30b9\u30ef\u30fc\u30c9\u5217
PASSWORD_COLUMN_HELP=<b>\u30d1\u30b9\u30ef\u30fc\u30c9\u5217</b><br>\u30d1\u30b9\u30ef\u30fc\u30c9\u5024\u3092\u4fdd\u6301\u3059\u308b\u30c6\u30fc\u30d6\u30eb\u5185\u306e\u5217\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u307e\u3059\u3002\u5024\u304c\u7a7a\u306e\u5834\u5408\u3001\u30ea\u30bd\u30fc\u30b9\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u691c\u8a3c\u306f\u6709\u52b9\u5316\u3055\u308c\u307e\u305b\u3093\u3002
JDBC_DRIVER_DISPLAY=JDBC \u30c9\u30e9\u30a4\u30d0
JDBC_DRIVER_HELP=<b>JDBC \u30c9\u30e9\u30a4\u30d0</b><br>JDBC \u30c9\u30e9\u30a4\u30d0 \u306e\u30af\u30e9\u30b9\u540d\u3092\u5165\u529b\u3057\u307e\u3059\u3002Oracle \u306f oracle.jdbc.driver.OracleDriver \u3067\u3059\u3002MySQL \u306f org.gjt.mm.mysql.Driver \u3067\u3059\u3002<br>\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u3092\u6307\u5b9a\u3059\u308b\u5834\u5408\u306f\u7a7a\u306b\u3067\u304d\u307e\u3059\u3002
URL_TEMPLATE_DISPLAY=JDBC \u63a5\u7d9a URL
URL_TEMPLATE_HELP=<b>JDBC \u63a5\u7d9a URL</b><br>JDBC \u30c9\u30e9\u30a4\u30d0\u63a5\u7d9a URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002<br> Oracle \u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306f\u3001jdbc:oracle:thin:@[\u30db\u30b9\u30c8]:[\u30dd\u30fc\u30c8 (1521)]:[DB] \u3067\u3059\u3002<br>  MySQL \u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306f\u3001jdbc:mysql://[\u30db\u30b9\u30c8]:[\u30dd\u30fc\u30c8 (3306)]/[db] \u3067\u3059\u3002\u8a73\u7d30\u306f\u3001JDBC \u30c9\u30e9\u30a4\u30d0\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002<br>\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u3092\u6307\u5b9a\u3059\u308b\u5834\u5408\u306f\u7a7a\u306b\u3067\u304d\u307e\u3059\u3002
ENABLE_EMPTY_STRING_DISPLAY=\u7a7a\u306e\u6587\u5b57\u5217\u306e\u66f8\u304d\u8fbc\u307f\u3092\u6709\u52b9\u306b\u3059\u308b
ENABLE_EMPTY_STRING_HELP=<b>\u7a7a\u306e\u6587\u5b57\u5217\u306e\u66f8\u304d\u8fbc\u307f\u3092\u6709\u52b9\u306b\u3059\u308b</b><br>\u30c6\u30fc\u30d6\u30eb\u30b9\u30ad\u30fc\u30de\u3067 not-null \u3068\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u6587\u5b57\u30d9\u30fc\u30b9\u306e\u5217\u306b NULL \u5024\u306e\u4ee3\u308f\u308a\u306b\u7a7a\u306e\u6587\u5b57\u5217\u3092\u66f8\u304d\u8fbc\u3080\u3053\u3068\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u5834\u5408\u306b\u9078\u629e\u3057\u307e\u3059\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001Oracle \u30d9\u30fc\u30b9\u306e\u30c6\u30fc\u30d6\u30eb\u306b\u5bfe\u3057\u3066\u6587\u5b57\u5217\u3092\u66f8\u304d\u8fbc\u3080\u65b9\u6cd5\u306b\u306f\u5f71\u97ff\u3057\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001\u7a7a\u306e\u6587\u5b57\u5217\u306f NULL \u5024\u3068\u3057\u3066\u66f8\u304d\u8fbc\u307e\u308c\u307e\u3059\u3002
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=\u3059\u3079\u3066\u306e SQLException \u3092\u518d\u30b9\u30ed\u30fc\u3059\u308b
RETHROW_ALL_SQLEXCEPTIONS_HELP=\u3053\u308c\u3092\u30aa\u30f3\u306b\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u304c 0 \u3067\u3042\u308b SQLException \u3092\u30b9\u30ed\u30fc\u3059\u308b SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u305d\u306e\u4f8b\u5916\u304c\u30ad\u30e3\u30c3\u30c1\u304a\u3088\u3073\u6291\u5236\u3055\u308c\u307e\u3059\u3002\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u304c 0 \u3067\u3042\u308b\u4f8b\u5916\u3092\u518d\u30b9\u30ed\u30fc\u3055\u305b\u308b\u306b\u306f\u3001\u3053\u308c\u3092\u30aa\u30f3\u306b\u3057\u307e\u3059\u3002
NATIVE_TIMESTAMPS_DISPLAY=\u30cd\u30a4\u30c6\u30a3\u30d6\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7 
NATIVE_TIMESTAMPS_HELP=<b>\u30cd\u30a4\u30c6\u30a3\u30d6\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7</b><br>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb\u304b\u3089\u3001java.sql.Timestamp \u5f62\u5f0f\u5185\u306e\u5217\u306e\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u30c7\u30fc\u30bf\u578b\u3092\u53d6\u5f97\u3059\u308b\u5834\u5408\u306b\u9078\u629e\u3057\u307e\u3059\u3002
ALL_NATIVE_DISPLAY=\u3059\u3079\u3066\u306e\u30cd\u30a4\u30c6\u30a3\u30d6
ALL_NATIVE_HELP=<b>\u3059\u3079\u3066\u306e\u30cd\u30a4\u30c6\u30a3\u30d6</b><br>\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb\u304b\u3089\u3001\u30cd\u30a4\u30c6\u30a3\u30d6\u5f62\u5f0f\u306e\u5217\u306e\u3059\u3079\u3066\u306e\u30c7\u30fc\u30bf\u578b\u3092\u53d6\u5f97\u3059\u308b\u5834\u5408\u306b\u9078\u629e\u3057\u307e\u3059\u3002
VALID_CONNECTION_QUERY_DISPLAY=\u63a5\u7d9a\u691c\u8a3c\u30af\u30a8\u30ea\u30fc
VALID_CONNECTION_QUERY_HELP=<b>\u63a5\u7d9a\u691c\u8a3c\u30af\u30a8\u30ea\u30fc</b><br>\u63a5\u7d9a\u304c\u6709\u52b9\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u30af\u30a8\u30ea\u30fc\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u7a7a\u306e\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5b9f\u88c5\u304c\u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u306e\u30aa\u30f3\u3068\u30aa\u30d5\u3092\u5207\u308a\u66ff\u3048\u3066\u30c6\u30b9\u30c8\u3057\u307e\u3059\u3002\u30c0\u30df\u30fc\u30c6\u30fc\u30d6\u30eb\u3067 1 \u3092\u9078\u629e\u3059\u308b\u3068\u3001\u3088\u308a\u52b9\u679c\u7684\u306b\u306a\u308b\u5834\u5408\u3082\u3042\u308a\u307e\u3059\u3002
CHANGE_LOG_COLUMN_DISPLAY=\u5909\u66f4\u30ed\u30b0\u5217 (\u540c\u671f)
CHANGE_LOG_COLUMN_HELP==<b>\u5909\u66f4\u30ed\u30b0\u5217</b><br>\u5909\u66f4\u30ed\u30b0\u5217\u306f\u3001\u6700\u7d42\u306e\u5909\u66f4\u6642\u523b\u3092\u4fdd\u6301\u3057\u307e\u3059\u3002\u3053\u306e\u5024\u304c\u3042\u308b\u3068\u3001\u540c\u671f\u6a5f\u80fd\u304c\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002
DATASOURCE_DISPLAY=\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u30d1\u30b9
DATASOURCE_HELP=<b>JDBC \u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u540d/\u30d1\u30b9</b><br>Oracle \u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3059\u308b\u305f\u3081\u306e JDBC \u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u540d/\u30d1\u30b9\u3092\u5165\u529b\u3057\u307e\u3059\u3002\u6307\u5b9a\u3057\u305f\u5834\u5408\u3001\u30b3\u30cd\u30af\u30bf\u306f\u63a5\u7d9a\u8a66\u884c\u306b\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u3060\u3051\u3092\u4f7f\u7528\u3057\u3001\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u305d\u306e\u4ed6\u306e\u30ea\u30bd\u30fc\u30b9\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u7121\u8996\u3057\u307e\u3059\u3002<br>\u4f8b: <CODE>jdbc/SampleDataSourceName</CODE>
JNDI_PROPERTIES_DISPLAY=\u521d\u671f JNDI \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
JNDI_PROPERTIES_HELP=<b>\u521d\u671f JNDI \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc</b><br>\u7a7a\u306b\u3059\u308b\u304b\u3001JDBC JNDI \u521d\u671f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30d5\u30a1\u30af\u30c8\u30ea\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30d7\u30ed\u30d0\u30a4\u30c0\u3092\u300c\u30ad\u30fc = \u5024\u300d\u306e\u5f62\u5f0f\u3067\u5165\u529b\u3057\u307e\u3059\u3002


name.blank=Name \u5c5e\u6027\u306f\u3001NULL \u307e\u305f\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
pwd.blank=Password \u5c5e\u6027\u306f\u3001NULL \u307e\u305f\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
invalid.jndi.entry=JNDI \u30a8\u30f3\u30c8\u30ea: {0} \u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
configuration.property.empty=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u304c\u7a7a\u3067\u3059\u3002
key.column.blank=\u30ad\u30fc\u5217\u540d\u306e\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
pwd.column.blank=\u30d1\u30b9\u30ef\u30fc\u30c9\u5217\u540d\u306e\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
changelog.column.blank=\u5909\u66f4\u30ed\u30b0\u5217\u540d\u306e\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
table.blank=\u30c6\u30fc\u30d6\u30eb\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
admin.user.blank=\u30e6\u30fc\u30b6\u30fc\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
admin.password.blank=\u30d1\u30b9\u30ef\u30fc\u30c9\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
host.blank=\u30db\u30b9\u30c8\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
port.blank=\u30dd\u30fc\u30c8\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
database.blank=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u7a7a\u3067\u3059\u3002
jdbc.template.blank=\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e JDBC \u63a5\u7d9a URL \u304c\u7a7a\u3067\u3059\u3002
jdbc.driver.blank=\u8a2d\u5b9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e JDBC \u30c9\u30e9\u30a4\u30d0\u304c\u7a7a\u3067\u3059\u3002
jdbc.driver.not.found=JDBC \u30c9\u30e9\u30a4\u30d0\u304c\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
invalid.quoting=\u7121\u52b9\u306a\u5f15\u7528 '{0}' \u3067\u3059\u3002
acount.object.class.required=\u64cd\u4f5c\u306b\u306f 'Account' 'ObjectClass' \u304c\u5fc5\u8981\u3067\u3059\u3002
auth.op.not.supported=\u8a8d\u8a3c\u64cd\u4f5c\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
auth.op.failed=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
invalid.attribute.set=\u7121\u52b9\u306a\u5c5e\u6027\u30bb\u30c3\u30c8\u3067\u3059\u3002
uid.blank=\u64cd\u4f5c\u306b\u306f\u6709\u52b9\u306a UID \u304c\u5fc5\u8981\u3067\u3059\u3002
result.handler.null=\u7d50\u679c\u30cf\u30f3\u30c9\u30e9\u304c NULL \u3067\u3059\u3002
passwd.column.eq.key.column=\u30d1\u30b9\u30ef\u30fc\u30c9\u5217\u3092\u30ad\u30fc\u5217\u3068\u540c\u3058\u306b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
passwd.column.eq.change.log.column=\u30d1\u30b9\u30ef\u30fc\u30c9\u5217\u3092\u5909\u66f4\u30ed\u30b0\u5217\u3068\u540c\u3058\u306b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
key.column.eq.change.log.column=\u30ad\u30fc\u5217\u3092\u5909\u66f4\u30ed\u30b0\u5217\u3068\u540c\u3058\u306b\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
query.invalid=\u63a5\u7d9a\u691c\u8a3c\u30af\u30a8\u30ea\u30fc '{0}' \u304c\u7d50\u679c\u30bb\u30c3\u30c8\u3092\u8fd4\u3057\u307e\u305b\u3093\u3002
more.users.deleted=\u7121\u52b9\u306a\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002UID '{0}' \u306b\u8907\u6570\u306e\u30ec\u30b3\u30fc\u30c9\u304c\u3042\u308a\u307e\u3059\u3002 
invalid.sync.token.value=\u540c\u671f\u30c8\u30fc\u30af\u30f3\u306e\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
