# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=Conector de tabela de banco de dados

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=Cita\u00e7\u00e3o de nome
QUOTING_HELP=<b>Cita\u00e7\u00e3o de nome</b><br>Selecione se os nomes de colunas do banco de dados deste recurso devem ser citados e os caracteres de cita\u00e7\u00e3o. Por padr\u00e3o, os nomes de colunas do banco de dados n\u00e3o s\u00e3o citados (Nenhuma). Para outras sele\u00e7\u00f5es (Simples, Duplas, Invertidas ou Par\u00eanteses), os nomes de colunas aparecer\u00e3o entre aspas simples, aspas duplas, aspas invertidas ou par\u00eanteses no SQL gerado para acessar o banco de dados.
HOST_DISPLAY=Host
HOST_HELP=<b>Host</b><br>Digite o nome do host onde o banco de dados est\u00e1 em execu\u00e7\u00e3o.
PORT_DISPLAY=Porta
PORT_HELP=<b>Porta TCP</b><br>Digite o n\u00famero da porta em que o servidor de banco de dados est\u00e1 ativo.
USER_DISPLAY=Usu\u00e1rio
USER_HELP=<b>Usu\u00e1rio</b><br>Digite o nome do usu\u00e1rio do banco de dados obrigat\u00f3rio com permiss\u00e3o na tabela de contas.
PASSWORD_DISPLAY=Senha do usu\u00e1rio
PASSWORD_HELP=<b>Senha do usu\u00e1rio</b><br>Digite uma conta de usu\u00e1rio com permiss\u00e3o para acessar a tabela de contas.
DATABASE_DISPLAY=Banco de dados
DATABASE_HELP=<b>Banco de dados</b><br>Digite o nome do banco de dados no servidor de banco de dados que cont\u00e9m a tabela.
TABLE_DISPLAY=Tabela
TABLE_HELP=<b>Tabela</b><br>Digite o nome da tabela no banco de dados que cont\u00e9m as contas.
KEY_COLUMN_DISPLAY=Coluna chave
KEY_COLUMN_HELP=<b>Coluna chave</b><br>Esse valor de coluna obrigat\u00f3rio ser\u00e1 usado como o identificador exclusivo de linhas da tabela.<br>
PASSWORD_COLUMN_DISPLAY=Coluna da senha
PASSWORD_COLUMN_HELP=<b>Coluna da senha</b><br>Digite o nome da coluna da tabela que conter\u00e1 os valores de senhas. Se ficar vazio, nenhuma valida\u00e7\u00e3o de recursos e senhas ser\u00e1 ativada.
JDBC_DRIVER_DISPLAY=Driver JDBC
JDBC_DRIVER_HELP=<b>Driver JDBC</b><br>Especifique o nome de classe do driver JDBC. O do Oracle \u00e9 oracle.jdbc.driver.OracleDriver. O do MySQL \u00e9 org.gjt.mm.mysql.Driver.<br>Poder\u00e1 ficar vazio se for fornecida a fonte de dados.
URL_TEMPLATE_DISPLAY=URL de conex\u00e3o JDBC
URL_TEMPLATE_HELP=<b>URL de conex\u00e3o JDBC</b><br>Especifique o URL de conex\u00e3o do driver JDBC.<br> O modelo Oracle \u00e9 jdbc:oracle:thin:@[host]:[porta(1521)]:[DB].<br>  O modelo MySQL \u00e9 jdbc:mysql://[host]:[porta(3306)]/[db]. Para obter mais informa\u00e7\u00f5es, leia a documenta\u00e7\u00e3o do driver JDBC.<br>Poder\u00e1 ficar vazio se for fornecida a fonte de dados.
ENABLE_EMPTY_STRING_DISPLAY=Ativar grava\u00e7\u00e3o de seq\u00fc\u00eancia vazia
ENABLE_EMPTY_STRING_HELP=<b>Ativar grava\u00e7\u00e3o de seq\u00fc\u00eancia vazia</b><br>Selecione para ativar o suporte para a grava\u00e7\u00e3o em seq\u00fc\u00eancias vazias em vez de um valor NULO, em colunas baseadas em caracteres definidas como n\u00e3o nulas no esquema de tabelas. Essa op\u00e7\u00e3o n\u00e3o influencia a maneira como as seq\u00fc\u00eancias s\u00e3o gravadas para tabelas baseadas em Oracle. Por padr\u00e3o, as seq\u00fc\u00eancias vazias s\u00e3o gravadas como um valor NULO.
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=Reacionar todas as exce\u00e7\u00f5es SQL
RETHROW_ALL_SQLEXCEPTIONS_HELP=Se essa op\u00e7\u00e3o n\u00e3o estiver selecionada, as exce\u00e7\u00f5es SQL acionadas pelas instru\u00e7\u00f5es SQL e dotadas de um c\u00f3digo de erro 0 ser\u00e3o detectadas e suprimidas. Selecione-a para reacionar as exce\u00e7\u00f5es com c\u00f3digos de erro 0.
NATIVE_TIMESTAMPS_DISPLAY=Carimbos de data/hora nativos 
NATIVE_TIMESTAMPS_HELP=<b>Carimbos de data/hora nativos</b><br>Selecione para recuperar o tipo de dados do carimbo de data/hora das colunas no formato java.sql.Carimbo de data/hora da tabela de banco de dados.
ALL_NATIVE_DISPLAY=Todos nativos
ALL_NATIVE_HELP=<b>Todos nativos</b><br>Selecione para recuperar todos os tipos de dados das colunas, em formato nativo, da tabela do banco de dados.
VALID_CONNECTION_QUERY_DISPLAY=Validar consulta de conex\u00e3o
VALID_CONNECTION_QUERY_HELP=<b>Validar consulta de conex\u00e3o</b><br>Pode ser especificada a consulta de verifica\u00e7\u00e3o da manuten\u00e7\u00e3o de conex\u00e3o. Se ficar vazio, a implementa\u00e7\u00e3o padr\u00e3o far\u00e1 o teste usando a op\u00e7\u00e3o liga/desliga a confirma\u00e7\u00e3o autom\u00e1tica. A sele\u00e7\u00e3o de 1 na tabela fict\u00edcia poderia ser mais eficiente.
CHANGE_LOG_COLUMN_DISPLAY=Coluna de registro de altera\u00e7\u00e3o (Sync)
CHANGE_LOG_COLUMN_HELP==<b>Coluna de registro de altera\u00e7\u00e3o</b><br>Essa coluna armazena a hora da \u00faltima altera\u00e7\u00e3o. O fornecimento deste valor ativa os recursos de sincroniza\u00e7\u00e3o.
DATASOURCE_DISPLAY=Caminho da fonte de dados
DATASOURCE_HELP=<b>Nome/caminho da fonte de dados JDBC</b><br>Digite o nome/caminho da fonte de dados JDBC para conex\u00e3o ao servidor Oracle. Se especificado, o conector tentar\u00e1 se conectar utilizando somente a fonte de dados e ignorar\u00e1 outros par\u00e2metros de recurso especificados.<br>o valor de exemplo \u00e9: <CODE>jdbc/SampleDataSourceName</CODE>
JNDI_PROPERTIES_DISPLAY=Propriedades do JNDI inicial
JNDI_PROPERTIES_HELP=<b>Propriedades do JNDI inicial</b><br>Pode ficar vazio ou voc\u00ea pode inserir a f\u00e1brica de contextos JNDI iniciais do JDBC e o provedor de contexto no formato: chave = valor.


name.blank=O atributo Nome n\u00e3o pode ser nulo nem ficar vazio.
pwd.blank=O atributo Senha n\u00e3o pode ser nulo nem ficar vazio.
invalid.jndi.entry=Valor inv\u00e1lido na entrada JNDI: {0}.
configuration.property.empty=A propriedade {0} est\u00e1 vazia.
key.column.blank=A propriedade de configura\u00e7\u00e3o de nome da coluna Chave est\u00e1 vazia.
pwd.column.blank=A propriedade de configura\u00e7\u00e3o de nome da coluna Senha est\u00e1 vazia.
changelog.column.blank=A propriedade de configura\u00e7\u00e3o de nome da coluna ChangeLog est\u00e1 vazia.
table.blank=A propriedade de configura\u00e7\u00e3o de tabela est\u00e1 vazia.
admin.user.blank=A propriedade de configura\u00e7\u00e3o de usu\u00e1rio est\u00e1 vazia.
admin.password.blank=A propriedade de configura\u00e7\u00e3o de senha est\u00e1 vazia.
host.blank=A propriedade de configura\u00e7\u00e3o de host est\u00e1 vazia.
port.blank=A propriedade de configura\u00e7\u00e3o de porta est\u00e1 vazia.
database.blank=A propriedade de configura\u00e7\u00e3o de banco de dados est\u00e1 vazia.
jdbc.template.blank=O URL de conex\u00e3o JDBC da propriedade de configura\u00e7\u00e3o est\u00e1 vazio.
jdbc.driver.blank=O driver JDBC da propriedade de configura\u00e7\u00e3o est\u00e1 vazio.
jdbc.driver.not.found=Driver JDBC n\u00e3o encontrado no caminho da classe.
invalid.quoting=Cita\u00e7\u00e3o inv\u00e1lida '{0}'.
acount.object.class.required=A opera\u00e7\u00e3o requer uma 'ObjectClass' 'Conta'.
auth.op.not.supported=N\u00e3o existe suporte para a opera\u00e7\u00e3o de autentica\u00e7\u00e3o.
auth.op.failed=Falha na autentica\u00e7\u00e3o do usu\u00e1rio {0}!
invalid.attribute.set=Conjunto de atributos inv\u00e1lido.
uid.blank=A opera\u00e7\u00e3o requer uma Uid v\u00e1lida!
result.handler.null=Operador de resultado nulo!
passwd.column.eq.key.column=A coluna Senha n\u00e3o deve ser id\u00eantica \u00e0 coluna Chave.
passwd.column.eq.change.log.column=A coluna Senha n\u00e3o deve ser id\u00eantica \u00e0 coluna Changelog.
key.column.eq.change.log.column=A coluna Chave n\u00e3o deve ser id\u00eantica \u00e0 coluna Changelog.
query.invalid=Validar consulta de conex\u00e3o '{0}' n\u00e3o retorna um conjunto de resultados.
more.users.deleted=Exclus\u00e3o de conta inv\u00e1lida; a uid '{0}' tem mais de um registro. 
invalid.sync.token.value=O valor do token de sincroniza\u00e7\u00e3o \u00e9 inv\u00e1lido.
