# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=Connettore tabella database

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=Virgolette nome
QUOTING_HELP=<b>Virgolette nome</b><br>Indicare se i nomi delle colonne del database per questa risorsa devono essere racchiusi tra virgolette e specificare il carattere da utilizzare a tale scopo. Nell\u2019impostazione predefinita, i nomi delle colonne del database non sono racchiusi tra virgolette (Nessuna). Scegliendo le altre opzioni (Singole, Doppie, Inverse o Parentesi quadre), i nomi delle colonne appariranno racchiusi rispettivamente da virgolette singole, virgolette doppie, virgolette inverse o parentesi quadre nel codice SQL generato per accedere al database.
HOST_DISPLAY=Host
HOST_HELP=<b>Host</b><br>Immettere il nome dell\u2019host che gestisce il database.
PORT_DISPLAY=Porta
PORT_HELP=<b>Porta TCP </b><br>Immettere il numero della porta su cui il server del database \u00e8 in ascolto.
USER_DISPLAY=Utente
USER_HELP=<b>Utente</b><br>Immettere il nome dell\u2019utente del database obbligatorio che dispone delle autorizzazioni per la tabella degli account.
PASSWORD_DISPLAY=Password utente
PASSWORD_HELP=<b>Password utente</b><br>Immettere un account utente che disponga delle autorizzazioni per accedere alla tabella degli account.
DATABASE_DISPLAY=Database
DATABASE_HELP=<b>Database</b><br>Immettere il nome del database sul server del database che contiene la tabella.
TABLE_DISPLAY=Tabella
TABLE_HELP=<b>Tabella</b><br>Immettere il nome della tabella nel database che contiene gli account.
KEY_COLUMN_DISPLAY=Colonna chiave
KEY_COLUMN_HELP=<b>Colonna chiave</b><br>Questo valore di colonna obbligatorio verr\u00e0 usato come identificatore univoco delle righe della tabella.<br>
PASSWORD_COLUMN_DISPLAY=Colonna password
PASSWORD_COLUMN_HELP=<b>Colonna password</b><br>Immettere il nome della colonna della tabella che sar\u00e0 utilizzata per memorizzare i valori delle password. Se viene lasciato vuoto, non verranno attivate la convalida sulla risorsa e le password.
JDBC_DRIVER_DISPLAY=Driver JDBC
JDBC_DRIVER_HELP=<b>Driver JDBC</b><br>Specificare il nome del driver JDBC. Per Oracle \u00e8 oracle.jdbc.driver.OracleDriver. Per MySQL \u00e8 org.gjt.mm.mysql.Driver.<br>Pu\u00f2 essere vuoto se si indica l\u2019origine dati.
URL_TEMPLATE_DISPLAY=URL di connessione JDBC
URL_TEMPLATE_HELP=<b>URL di connessione JDBC</b><br>Specificare l\u2019URL di connessione al driver JDBC.<br>Il modello per Oracle \u00e8 jdbc:oracle:thin:@[host]:[port(1521)]:[DB].<br>Il modello per MySQL \u00e8 jdbc:mysql://[host]:[port(3306)]/[db]. Per maggiori informazioni, vedere la documentazione del driver JDBC.<br>Pu\u00f2 essere vuoto se si indica l\u2019origine dati.
ENABLE_EMPTY_STRING_DISPLAY=Abilita scrittura stringa vuota
ENABLE_EMPTY_STRING_HELP=<b>Abilita scrittura stringa vuota</b><br>Selezionare per consentire l\u2019utilizzo di una stringa vuota, al posto di un valore NULL, nelle colonne di caratteri definite come non nulle nello schema della tabella. Questa opzione non ha effetto sul metodo con cui le stringhe vengono scritte nelle tabelle Oracle. Per impostazione predefinita, le stringhe vuote vengono scritte come valori NULL.
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=Emetti nuovamente tutte le eccezioni SQL
RETHROW_ALL_SQLEXCEPTIONS_HELP=Se l\u2019opzione non \u00e8 selezionata, le eccezioni delle istruzioni SQL che producono SQLExceptions con il codice di errore 0 vengono intercettate e soppresse. Selezionare l\u2019opzione per fare in modo che le eccezioni con codice di errore 0 vengano emesse nuovamente.
NATIVE_TIMESTAMPS_DISPLAY=Marcatori orari nativi 
NATIVE_TIMESTAMPS_HELP=<b>Marcatori orari nativi</b><br>Selezionare per richiamare i tipi di dati di marcatore orario delle colonne in formato java.sql.Timestamp dalla tabella di database.
ALL_NATIVE_DISPLAY=Tutto nativo
ALL_NATIVE_HELP=<b>Tutto nativo</b><br>Selezionare questa opzione per richiamare in formato nativo tutti i tipi di dati delle colonne dalla tabella del database.
VALID_CONNECTION_QUERY_DISPLAY=Query di convalida connessione
VALID_CONNECTION_QUERY_HELP=<b>Query di convalida connessione</b><br>\u00c8 possibile specificare la query per mantenere attiva la connessione. Se questa opzione \u00e8 vuota, l'implementazione predefinita eseguir\u00e0 il test usando l'impostazione di attivazione/disattivazione di autocommit. La selezione 1 dalla tabella fittizia potrebbe essere pi\u00f9 efficiente.
CHANGE_LOG_COLUMN_DISPLAY=Colonna log delle modifiche (Sincr.)
CHANGE_LOG_COLUMN_HELP==<b>Colonna log delle modifiche</b><br>La colonna del log delle modifiche memorizza l\u2019ora dell\u2019ultima modifica. Indicando questo valore si attivano le capacit\u00e0 di sincronizzazione.
DATASOURCE_DISPLAY=Percorso origine dati
DATASOURCE_HELP=<b>Nome/percorso origine dati JDBC</b><br>Immettere il nome e il percorso dell\u2019origine dati JDBC per la connessione al server Oracle. Se il percorso viene specificato, il connettore cercher\u00e0 di connettersi usando solo l\u2019origine dati, ignorando gli altri parametri della risorsa specificati.<br>valore di esempio: <CODE>jdbc/SampleDataSourceName</CODE>
JNDI_PROPERTIES_DISPLAY=Propriet\u00e0 JNDI iniziale
JNDI_PROPERTIES_HELP=<b>Propriet\u00e0 JNDI iniziale</b><br>Lasciare vuoto o immettere i valori per la produzione del contesto iniziale e il provider del contesto JNDI JDBC nel formato: chiave = valore.


name.blank=L\u2019attributo del nome non pu\u00f2 essere nullo o vuoto.
pwd.blank=L\u2019attributo della password non pu\u00f2 essere nullo o vuoto.
invalid.jndi.entry=Valore non valido nella voce JNDI: {0}.
configuration.property.empty=La propriet\u00e0 {0} \u00e8 vuota.
key.column.blank=La propriet\u00e0 di configurazione del nome della colonna della chiave \u00e8 vuota.
pwd.column.blank=La propriet\u00e0 di configurazione del nome della colonna della password \u00e8 vuota.
changelog.column.blank=La propriet\u00e0 di configurazione del nome della colonna del log delle modifiche \u00e8 vuota.
table.blank=La propriet\u00e0 di configurazione della tabella \u00e8 vuota.
admin.user.blank=La propriet\u00e0 di configurazione dell\u2019utente \u00e8 vuota.
admin.password.blank=La propriet\u00e0 di configurazione della password \u00e8 vuota.
host.blank=La propriet\u00e0 di configurazione dell\u2019host \u00e8 vuota.
port.blank=La propriet\u00e0 di configurazione della porta \u00e8 vuota.
database.blank=La propriet\u00e0 di configurazione del database \u00e8 vuota.
jdbc.template.blank=La propriet\u00e0 di configurazione dell\u2019URL di connessione JDBC \u00e8 vuota.
jdbc.driver.blank=La propriet\u00e0 di configurazione del driver JDBC \u00e8 vuota.
jdbc.driver.not.found=Driver JDBC non trovato nel percorso classpath.
invalid.quoting=Uso delle virgolette errato \u2019{0}\u2019.
acount.object.class.required=L\u2019operazione richiede un \u2019ObjectClass\u2019 \u2019Account\u2019.
auth.op.not.supported=L\u2019operazione di autenticazione non \u00e8 supportata.
auth.op.failed=Autenticazione dell\u2019utente {0} non riuscita.
invalid.attribute.set=Gli attributi impostati non sono validi.
uid.blank=L\u2019operazione richiede un Uid valido.
result.handler.null=Il gestore risultato \u00e8 nullo.
passwd.column.eq.key.column=La colonna della password non pu\u00f2 essere uguale a quella della chiave.
passwd.column.eq.change.log.column=La colonna della password non pu\u00f2 essere uguale a quella del log delle modifiche.
key.column.eq.change.log.column=La colonna della chiave non pu\u00f2 essere uguale a quella del log delle modifiche.
query.invalid=La query di convalida della connessione \u2019{0}\u2019 non ha restituito un insieme di risultati.
more.users.deleted=Impossibile eliminare l\u2019account, l\u2019uid \u2019{0}\u2019 corrisponde a pi\u00f9 di un record. 
invalid.sync.token.value=Il valore del token di sincronizzazione non \u00e8 valido.
