# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=Connecteur de table de base de donn\u00e9es

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=Guillemets de noms
QUOTING_HELP=<b>Guillemets de noms</b><br>Indiquez si les noms des colonnes de la table de base de donn\u00e9es pour cette ressource doivent \u00eatre encadr\u00e9s et les caract\u00e8res \u00e0 utiliser. Par d\u00e9faut, ces noms ne sont pas encadr\u00e9s (Aucun). Pour les autres s\u00e9lections (Simples, Doubles, Invers\u00e9s ou Parenth\u00e8ses), les noms des colonnes figureront entre guillemets anglo-saxons simples, doubles, invers\u00e9s ou entre parenth\u00e8ses dans la requ\u00eate SQL g\u00e9n\u00e9r\u00e9e pour acc\u00e9der \u00e0 la base de donn\u00e9es.
HOST_DISPLAY=H\u00f4te
HOST_HELP=<b>H\u00f4te</b><br>Indiquez\u00b7le nom de l\u2019h\u00f4te sur lequel la base de donn\u00e9es est ex\u00e9cut\u00e9e.
PORT_DISPLAY=Port
PORT_HELP=<b>Port TCP</b><br>Indiquez le num\u00e9ro de port sur lequel le serveur de base de donn\u00e9es \u00e9coute.
USER_DISPLAY=Utilisateur
USER_HELP=<b>Utilisateur</b><br>Indiquez le nom de l\u2019utilisateur de la base de donn\u00e9es obligatoire autoris\u00e9 \u00e0 acc\u00e9der \u00e0 la table des comptes.
PASSWORD_DISPLAY=Mot de passe utilisateur
PASSWORD_HELP=<b>Mot de passe utilisateur</b><br>Indiquez un compte utilisateur autoris\u00e9 \u00e0 acc\u00e9der \u00e0 la table des comptes.
DATABASE_DISPLAY=Base de donn\u00e9es
DATABASE_HELP=<b>Base de donn\u00e9es</b><br>Indiquez le nom de la base de donn\u00e9es stock\u00e9e sur le serveur de base de donn\u00e9es contenant la table.
TABLE_DISPLAY=Table
TABLE_HELP=<b>Table</b><br>Saisissez le nom de la table figurant dans la base de donn\u00e9es qui contient les comptes.
KEY_COLUMN_DISPLAY=Colonne de cl\u00e9
KEY_COLUMN_HELP=<b>Colonne de cl\u00e9</b><br>Cette valeur de colonne obligatoire servira d\u2019identificateur unique aux rang\u00e9es de la table.<br>
PASSWORD_COLUMN_DISPLAY=Colonne de mot de passe
PASSWORD_COLUMN_HELP=<b>Colonne de mot de passe</b><br>Indiquez le nom de la colonne de la table \u00e0 utiliser pour stocker les valeurs de mot de passe. Si elle reste vide, aucune validation de ressource et de mots de passe n\u2019est activ\u00e9e.
JDBC_DRIVER_DISPLAY=Pilote JDBC
JDBC_DRIVER_HELP=<b>Pilote JDBC</b><br>Sp\u00e9cifiez le nom de classe de pilote JDBC. Oracle est oracle.jdbc.driver.OracleDriver. MySQL est org.gjt.mm.mysql.Driver.<br>Peut \u00eatre vide si datasource est sp\u00e9cifi\u00e9.
URL_TEMPLATE_DISPLAY=URL de connexion JDBC
URL_TEMPLATE_HELP=<b>URL de connexion JDBC</b><br>Sp\u00e9cifiez l\u2019URL de connexion au pilote JDBC.<br> Le mod\u00e8le Oracle est jdbc:oracle:thin:@[h\u00f4te]:[port(1521)]:[BD].<br> Le mod\u00e8le MySQL est jdbc:mysql://[h\u00f4te]:[port(3306)]/[bd]. Pour plus d\u2019informations, lisez la documentation du pilote JDBC.<br>Peut \u00eatre vide si datasource est sp\u00e9cifi\u00e9.
ENABLE_EMPTY_STRING_DISPLAY=Activer l\u2019\u00e9criture de cha\u00eenes vides
ENABLE_EMPTY_STRING_HELP=<b>Activer l\u2019\u00e9criture de cha\u00eenes vides</b><br>S\u00e9lectionnez cette option pour activer la prise en charge d\u2019une cha\u00eene vide, \u00e0 la place d\u2019une valeur NULL, dans les colonnes bas\u00e9es sur des caract\u00e8res d\u00e9finies comme non nulles dans le sch\u00e9ma de la table. Cette option n\u2019influe pas sur la fa\u00e7on dont les cha\u00eenes sont \u00e9crites pour les tables bas\u00e9es sur Oracle. Par d\u00e9faut, les cha\u00eenes vides sont \u00e9crites sous la forme d\u2019une valeur NULL.
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=Jeter de nouveau toutes les exceptions SQL
RETHROW_ALL_SQLEXCEPTIONS_HELP=Lorsque cette option n\u2019est pas coch\u00e9e, les exceptions SQL jet\u00e9es par les instructions SQL et dot\u00e9es d\u2019un code d\u2019erreur \u00e9gal \u00e0 0 sont d\u00e9tect\u00e9es et supprim\u00e9es. Cochez cette case afin que les exceptions de ce type soient rejet\u00e9es.
NATIVE_TIMESTAMPS_DISPLAY=Horodatages natifs 
NATIVE_TIMESTAMPS_HELP=<b>Horodatages natifs</b><br>S\u00e9lectionnez cette option pour r\u00e9cup\u00e9rer le type des donn\u00e9es d\u2019horodatage des colonnes au format java.sql.Timestamp \u00e0 partir de la table de base de donn\u00e9es.
ALL_NATIVE_DISPLAY=Tous natifs
ALL_NATIVE_HELP=<b>Tous natifs</b><br>S\u00e9lectionnez cette option pour r\u00e9cup\u00e9rer tous les types de donn\u00e9es des colonnes ayant un format natif dans la table de la base de donn\u00e9es.
VALID_CONNECTION_QUERY_DISPLAY=Valider la requ\u00eate de connexion
VALID_CONNECTION_QUERY_HELP=<b>Valider la requ\u00eate de connexion</b><br>Cette option permet de sp\u00e9cifier la v\u00e9rification de la requ\u00eate directe de connexion. Si elle est vide, l\u2019impl\u00e9mentation par d\u00e9faut teste la connexion en activant/d\u00e9sactivant la validation automatique. Il peut s\u2019av\u00e9rer plus efficace de s\u00e9lectionner 1 dans la table de test.
CHANGE_LOG_COLUMN_DISPLAY=Colonne du journal des modifications (synchr.)
CHANGE_LOG_COLUMN_HELP==<b>Colonne du journal des modifications (synchr.)</b><br>Cette colonne stocke l\u2019heure du dernier changement. La sp\u00e9cification d\u2019une valeur pour cette option entra\u00eene l\u2019activation de la fonction de synchronisation.
DATASOURCE_DISPLAY=Chemin d\u2019acc\u00e8s \u00e0 la source de donn\u00e9es
DATASOURCE_HELP=<b>Nom/chemin de source de donn\u00e9es JDBC</b><br>Saisissez le nom/chemin de la source de donn\u00e9es JDBC permettant de se connecter au serveur Oracle. Si sp\u00e9cifi\u00e9, le connecteur tentera seulement de se connecter en utilisant Datasource et ignorera les autres param\u00e8tres de ressource indiqu\u00e9s.<br>Exemple de valeur : <CODE>jdbc/SampleDataSourceName</CODE>
JNDI_PROPERTIES_DISPLAY=Propri\u00e9t\u00e9s JNDI initiales
JNDI_PROPERTIES_HELP=<b>Propri\u00e9t\u00e9s JNDI initiales</b><br>Vous pouvez laisser ce champ vide ou saisir la fabrique de contexte initiale JNDI JDBC, le fournisseur de contexte en respectant le format : cl\u00e9 = valeur.


name.blank=L\u2019attribut Nom ne peut pas \u00eatre nul ou vide.
pwd.blank=L\u2019attribut Mot de passe ne peut pas \u00eatre nul ou vide.
invalid.jndi.entry=Valeur incorrecte dans l\u2019entr\u00e9e JNDI : {0}.
configuration.property.empty=La propri\u00e9t\u00e9 {0} est vide.
key.column.blank=La propri\u00e9t\u00e9 de configuration du nom de la colonne de cl\u00e9 est vide.
pwd.column.blank=La propri\u00e9t\u00e9 de configuration du nom de la colonne de mot de passe est vide.
changelog.column.blank=La propri\u00e9t\u00e9 de configuration du nom de la colonne de journal des modifications est vide.
table.blank=La propri\u00e9t\u00e9 de configuration de la table est vide.
admin.user.blank=La propri\u00e9t\u00e9 de configuration de l\u2019utilisateur est vide.
admin.password.blank=La propri\u00e9t\u00e9 de configuration du mot de passe est vide.
host.blank=La propri\u00e9t\u00e9 de configuration de l\u2019h\u00f4te est vide.
port.blank=La propri\u00e9t\u00e9 de configuration du port est vide.
database.blank=La propri\u00e9t\u00e9 de configuration de la base de donn\u00e9es est vide.
jdbc.template.blank=La propri\u00e9t\u00e9 de configuration de l\u2019URL de connexion JDBC est vide
jdbc.driver.blank=La propri\u00e9t\u00e9 de configuration Pilote JDBC est vide.
jdbc.driver.not.found=Le pilote JDBC ne se trouve pas sur le classpath.
invalid.quoting=Guillemet \u2019{0}\u2019 incorrect.
acount.object.class.required=L\u2019op\u00e9ration requiert une classe d\u2019objet de type Account.
auth.op.not.supported=L\u2019op\u00e9ration d\u2019authentification n\u2019est pas prise en charge.
auth.op.failed=L\u2019authentification de l\u2019utilisateur {0} a \u00e9chou\u00e9.
invalid.attribute.set=Les attributs d\u00e9finis sont incorrects.
uid.blank=L\u2019op\u00e9ration requiert un UID correct.
result.handler.null=Le gestionnaire de r\u00e9sultats est nul.
passwd.column.eq.key.column=La colonne du mot de passe doit \u00eatre diff\u00e9rente de celle de la cl\u00e9.
passwd.column.eq.change.log.column=La colonne du mot de passe doit \u00eatre diff\u00e9rente de celle du journal des modifications.
key.column.eq.change.log.column=La colonne de cl\u00e9 doit \u00eatre diff\u00e9rente de celle du journal des modifications.
query.invalid=La validation de la requ\u00eate de connexion \u2019{0}\u2019 ne retourne pas de jeu de r\u00e9sultats.
more.users.deleted=La suppression du compte est incorrecte, l\u2019UID \u2019{0}\u2019 compte plus d\u2019un enregistrement. 
invalid.sync.token.value=La valeur du jeton de synchronisation est incorrecte.
