# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=Conector de tabla de base de datos

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=Citas de nombres
QUOTING_HELP=<b>Citas de nombres</b><br>Seleccione si los nombres de columna de base de datos para este recurso deben marcarse como citas, y con qu\u00e9 caracteres. De manera predeterminada, los nombres de columna de base de datos no se marcan (Ninguna). Con las otras opciones (Sencilla, Doble, Acentos o Corchetes), los nombres de columna aparecen entre comillas sencillas, comillas dobles, acentos graves o corchetes en el c\u00f3digo SQL generado para acceder a la base de datos.
HOST_DISPLAY=Host
HOST_HELP=<b>Host</b><br>Introduzca el nombre del host en el que se est\u00e1 ejecutando la base de datos.
PORT_DISPLAY=Puerto
PORT_HELP=<b>Puerto TCP</b><br>Introduzca el n\u00famero de puerto al que est\u00e1 conectado el servidor de base de datos.
USER_DISPLAY=Usuario
USER_HELP=<b>Usuario</b><br>Introduzca el nombre del usuario obligatorio de la base de datos que tiene permiso sobre la tabla de cuentas.
PASSWORD_DISPLAY=Contrase\u00f1a de usuario
PASSWORD_HELP=<b>Contrase\u00f1a de usuario</b><br>Introduzca una cuenta de usuario con permiso para acceder a la tabla de cuentas.
DATABASE_DISPLAY=Base de datos
DATABASE_HELP=<b>Base de datos</b><br>Introduzca el nombre de la base de datos presente en el servidor de base de datos que contiene la tabla.
TABLE_DISPLAY=Tabla
TABLE_HELP=<b>Tabla</b><br>Introduzca el nombre de la tabla presente en la base de datos que contiene las cuentas.
KEY_COLUMN_DISPLAY=Columna clave
KEY_COLUMN_HELP=<b>Columna clave</b><br>Este valor de columna obligatorio se utilizar\u00e1 como identificador \u00fanico para las filas de la tabla.<br>
PASSWORD_COLUMN_DISPLAY=Columna Contrase\u00f1a
PASSWORD_COLUMN_HELP=<b>Columna Contrase\u00f1a</b><br>Escriba el nombre de la columna de la tabla que contendr\u00e1 los valores de contrase\u00f1a. Si este campo queda vac\u00edo, no se activa validaci\u00f3n de recursos ni contrase\u00f1as.
JDBC_DRIVER_DISPLAY=Controlador JDBC
JDBC_DRIVER_HELP=<b>Controlador JDBC</b><br>Especifique el nombre de la clase del controlador JDBC. Oracle es oracle.jdbc.driver.OracleDriver. MySQL es org.gjt.mm.mysql.Driver.<br>Podr\u00eda quedar vac\u00edo si se suministra el origen de datos.
URL_TEMPLATE_DISPLAY=URL de conexi\u00f3n JDBC
URL_TEMPLATE_HELP=<b>URL de conexi\u00f3n JDBC</b><br>Especifique la URL de conexi\u00f3n del controlador JDBC.<br> La plantilla de Oracle es jdbc:oracle:thin:@[host]:[port(1521)]:[DB].<br>  La plantilla de MySQL es jdbc:mysql://[host]:[port(3306)]/[db]. Encontrar\u00e1 m\u00e1s informaci\u00f3n en la documentaci\u00f3n del controlador JDBC.<br>Podr\u00eda quedar vac\u00edo si se suministra el origen de datos.
ENABLE_EMPTY_STRING_DISPLAY=Habilitar escritura de cadenas vac\u00edas
ENABLE_EMPTY_STRING_HELP=<b>Habilitar escritura de cadenas vac\u00edas</b><br>Seleccione esta opci\u00f3n para habilitar la escritura de cadenas vac\u00edas en lugar de valores nulos (NULL) en columnas basadas en caracteres que han sido definidas como 'no nulos' (not-null) en el esquema de tablas. Esta opci\u00f3n no afecta a la forma en que se escriben las cadenas en las tablas Oracle. Las cadenas vac\u00edas se escriben como valores NULL de forma predeterminada.
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=Volver a enviar todas las SQLExceptions
RETHROW_ALL_SQLEXCEPTIONS_HELP=Si esta opci\u00f3n no est\u00e1 marcada, se procesar\u00e1n y eliminar\u00e1n las excepciones de las instrucciones SQL que env\u00eden SQLExceptions con 0 como c\u00f3digo de error. Marque esta casilla para volver a enviar las excepciones de c\u00f3digo de error 0.
NATIVE_TIMESTAMPS_DISPLAY=Marcas de fecha y hora nativas 
NATIVE_TIMESTAMPS_HELP=<b>Marcas de fecha y hora nativas</b><br>Seleccione esta opci\u00f3n para recuperar el tipo de datos de la marca de fecha y hora de las columnas en el formato java.sql.Timestamp de la tabla de base de datos.
ALL_NATIVE_DISPLAY=Todo nativo
ALL_NATIVE_HELP=<b>Todo nativo</b><br>Seleccione esta opci\u00f3n para recuperar todos los tipos de datos de las columnas en un formato nativo desde la tabla de base de datos.
VALID_CONNECTION_QUERY_DISPLAY=Consulta de validaci\u00f3n de conexi\u00f3n
VALID_CONNECTION_QUERY_HELP=<b>Consulta de validaci\u00f3n de conexi\u00f3n</b><br>Aqu\u00ed se puede especificar la consulta activa para verificar la conexi\u00f3n. Si se deja vac\u00edo, la implementaci\u00f3n predeterminada realizar\u00e1 la comprobaci\u00f3n aplicando la opci\u00f3n de activaci\u00f3n/desactivaci\u00f3n de asignaci\u00f3n autom\u00e1tica. Podr\u00eda ser m\u00e1s eficaz seleccionar 1 en la tabla ficticia.
CHANGE_LOG_COLUMN_DISPLAY=Columna de registro de cambios (sincronismo)
CHANGE_LOG_COLUMN_HELP==<b>Columna de registro de cambios</b><br>La columna de registro de cambios almacena la hora del \u00faltimo cambio. Las funciones de sincronismo se activan seg\u00fan este valor.
DATASOURCE_DISPLAY=Ruta de origen de datos
DATASOURCE_HELP=<b>Nombre/Ruta de origen de datos JDBC</b><br>Introduzca el Nombre/Ruta de origen de datos JDBC para conectar al servidor Oracle. Si se especifica, el conector s\u00f3lo tratar\u00e1 de conectarse utilizando el origen de datos (Datasource) e ignorar\u00e1 otros par\u00e1metros de recurso especificados.<br>el valor de ejemplo es: <CODE>jdbc/NombreOrigenDatosEjemplo</CODE>
JNDI_PROPERTIES_DISPLAY=Propiedades de JNDI iniciales
JNDI_PROPERTIES_HELP=<b>Propiedades de JNDI iniciales</b><br>Se puede dejar vac\u00edo o introducir el proveedor de contexto inicial de f\u00e1brica JDBC JNDI con el formato: clave = valor.


name.blank=El atributo Name no puede ser nulo ni estar vac\u00edo.
pwd.blank=El atributo Password no puede ser nulo ni estar vac\u00edo.
invalid.jndi.entry=Valor no v\u00e1lido en entrada de JNDI: {0}.
configuration.property.empty=La propiedad {0} est\u00e1 vac\u00eda.
key.column.blank=La propiedad de configuraci\u00f3n del nombre de columna de clave est\u00e1 vac\u00eda.
pwd.column.blank=La propiedad de configuraci\u00f3n del nombre de columna de contrase\u00f1a est\u00e1 vac\u00eda.
changelog.column.blank=La propiedad de configuraci\u00f3n del nombre de columna de registro de cambios est\u00e1 vac\u00eda.
table.blank=La propiedad de configuraci\u00f3n de la tabla est\u00e1 vac\u00eda.
admin.user.blank=La propiedad de configuraci\u00f3n del usuario est\u00e1 vac\u00eda.
admin.password.blank=La propiedad de configuraci\u00f3n de la contrase\u00f1a est\u00e1 vac\u00eda.
host.blank=La propiedad de configuraci\u00f3n del host est\u00e1 vac\u00eda.
port.blank=La propiedad de configuraci\u00f3n del puerto est\u00e1 vac\u00eda.
database.blank=La propiedad de configuraci\u00f3n de la base de datos est\u00e1 vac\u00eda.
jdbc.template.blank=La propiedad de configuraci\u00f3n de la URL de conexi\u00f3n JDBC est\u00e1 vac\u00eda.
jdbc.driver.blank=La propiedad de configuraci\u00f3n del controlador JDBC est\u00e1 vac\u00eda.
jdbc.driver.not.found=El controlador JDBC no se ha encontrado en la ruta de clase.
invalid.quoting=Citas '{0}' no v\u00e1lidas.
acount.object.class.required=La operaci\u00f3n requiere un objeto de clase de cuenta.
auth.op.not.supported=No se admite la operaci\u00f3n de autenticaci\u00f3n.
auth.op.failed=Ha fallado la autenticaci\u00f3n del usuario {0}.
invalid.attribute.set=Se han configurado atributos no v\u00e1lidos.
uid.blank=La operaci\u00f3n requiere un Uid v\u00e1lido.
result.handler.null=El controlador de resultado es nulo.
passwd.column.eq.key.column=La columna de contrase\u00f1a no debe ser igual que la columna de clave.
passwd.column.eq.change.log.column=La columna de contrase\u00f1a no debe ser igual que la columna de registro de cambios.
key.column.eq.change.log.column=La columna de clave no debe ser igual que la columna de registro de cambios.
query.invalid=La consulta de validaci\u00f3n de conexi\u00f3n '{0}' no devuelve un conjunto de resultados.
more.users.deleted=Eliminaci\u00f3n de cuenta no v\u00e1lida, el uid '{0}' tiene varios registros. 
invalid.sync.token.value=El valor del token de sincronismo no es v\u00e1lido.
