# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE

DBTABLE_CONNECTOR=Datenbanktabellen-Connector

#property message key name must equal the property name with the _DISPLAY or _HELP extension, or can be customized using the ConfigurationProperty attribute
QUOTING_DISPLAY=Namen in Anf\u00fchrungszeichen
QUOTING_HELP=<b>Namen in Anf\u00fchrungszeichen</b><br>Legen Sie fest, ob die Namen der Datenbankspalten f\u00fcr diese Ressource in Anf\u00fchrungszeichen gesetzt werden sollen. Geben Sie au\u00dferdem die Art der Anf\u00fchrungszeichen an. Standardm\u00e4\u00dfig werden die Namen der Datenbankspalten nicht in Anf\u00fchrungszeichen gesetzt (<b>Keine</b>). Bei anderen Auswahloptionen (<b>Einfach</b>, <b>Doppelt</b>, <b>Linksgerichtet</b> und <b>Eckige Klammern</b>) werden die Spaltennamen im generierten SQL-Code f\u00fcr den Zugriff auf die Datenbank in einfache Anf\u00fchrungszeichen, doppelte Anf\u00fchrungszeichen, linksgerichtete Anf\u00fchrungszeichen oder eckige Klammern gesetzt.
HOST_DISPLAY=Host
HOST_HELP=<b>Host</b><br>Geben Sie den Namen des Hosts ein, auf dem die Datenbank ausgef\u00fchrt wird.
PORT_DISPLAY=Port
PORT_HELP=<b>TCP-Port</b><br>Geben Sie die Portnummer ein, die f\u00fcr den Datenbankserver verwendet wird.
USER_DISPLAY=Benutzer
USER_HELP=<b>Benutzer</b><br>Geben Sie den Namen des obligatorischen Datenbankenbenutzers mit Zugriff auf die Kontentabelle ein.
PASSWORD_DISPLAY=Benutzer-Passwort
PASSWORD_HELP=<b>Benutzer-Passwort</b><br>Geben Sie einen Benutzerkonto ein, das berechtigt ist, auf die Kontentabelle zuzugreifen.
DATABASE_DISPLAY=Datenbank
DATABASE_HELP=<b>Datenbank</b><br>Geben Sie den Namen der Datenbank auf dem Datenbankserver ein, die die Tabelle enth\u00e4lt.
TABLE_DISPLAY=Tabelle
TABLE_HELP=<b>Tabelle</b><br>Geben Sie den Namen der Datenbanktabelle ein, die die Konten enth\u00e4lt.
KEY_COLUMN_DISPLAY=Schl\u00fcsselspalte
KEY_COLUMN_HELP=<b>Schl\u00fcsselspalte</b><br>Dieser obligatorischen Spaltenwert wird als eindeutiger Bezeichner f\u00fcr Reihen in der Tabelle verwendet.<br>
PASSWORD_COLUMN_DISPLAY=Passwortspalte
PASSWORD_COLUMN_HELP=<b>Passwortspalte</b><br>Geben Sie den Namen der Tabellenspalte ein, in der die Passwortwerte enthalten sind. Ist hier kein Wert eingegeben, findet keine Validierung bei Ressourcen und Passw\u00f6rtern statt.
JDBC_DRIVER_DISPLAY=JDBC-Treiber
JDBC_DRIVER_HELP=<b>JDBC-Treiber</b><br>Geben Sie den JDBC-Treiber-Klassennamen an. Oracle lautet oracle.jdbc.driver.OracleDriver. MySQL lautet org.gjt.mm.mysql.Driver.<br>Darf leer sein, wenn die Datenquelle angegeben wird.
URL_TEMPLATE_DISPLAY=URL der JDBC-Verbindung
URL_TEMPLATE_HELP=<b>URL der JDBC-Verbindung</b><br>Geben Sie die URL der JDBC-Treiberverbindung an.<br> Die Oracle-Vorlage ist jdbc:oracle:thin:@[host]:[port(1521)]:[DB].<br> Die MySQL-Vorlage ist jdbc:mysql://[host]:[port(3306)]/[db]. Weitere Informationen finden Sie in der JDBC-Treiberdokumentation.<br>Darf leer sein, wenn die Datenquelle angegeben wird.
ENABLE_EMPTY_STRING_DISPLAY=Schreiben leerer Zeichenketten aktivieren
ENABLE_EMPTY_STRING_HELP=<b>Schreiben leerer Zeichenketten aktivieren</b><br>W\u00e4hlen Sie diese Option, um die Unterst\u00fctzung f\u00fcr das Schreiben leerer Zeichenketten anstelle von NULL-Werten in zeichenbasierten Spalten zu aktivieren, die im Tabellenschema als nicht-Null definiert sind. Diese Option wirkt sich nicht darauf aus, wie Zeichenketten f\u00fcr Oracle-basierte Tabellen geschrieben werden. Standardm\u00e4\u00dfig werden leere Zeichenketten als ein NULL-Wert geschrieben.
RETHROW_ALL_SQLEXCEPTIONS_DISPLAY=Alle SQLExceptions erneut ausl\u00f6sen
RETHROW_ALL_SQLEXCEPTIONS_HELP=Wenn diese Option nicht aktiviert ist, werden bei SQL-Anweisungen, die SQLExceptions mit einem Fehlercode 0 erzeugen, diese Ausnahmen abgefangen und unterdr\u00fcckt. Aktivieren Sie diese Option, damit Ausnahmen mit Fehlercode 0 erneut ausgel\u00f6st werden.
NATIVE_TIMESTAMPS_DISPLAY=Native Zeitstempel 
NATIVE_TIMESTAMPS_HELP=<b>Native Zeitstempel</b><br>W\u00e4hlen Sie diese Option aus, um aus der Datenbanktabelle Zeitstempel-Datentypen der Spalten im Format java.sql.Timestamp abzurufen.
ALL_NATIVE_DISPLAY=Alle Nativen
ALL_NATIVE_HELP=<b>Alle Nativen</b><br>W\u00e4hlen Sie diese Option, um alle Datentypen der Spalte in ihrem nativen Format aus der Datenbanktabelle abzurufen.
VALID_CONNECTION_QUERY_DISPLAY=Verbindungsabfrage validieren
VALID_CONNECTION_QUERY_HELP=<b>Verbindungsabfrage validieren</b><br>Hier kann eine Abfrage zur Pr\u00fcfung der Verbindung eingegeben werden. Wurde hier kein Wert eingegeben, testet die Standardimplementierung die Verbindung durch Aktivieren/Deaktivieren der Autocommit-Funktion. Das Ausw\u00e4hlen von 1 aus der Dummy-Tabelle ist eventuell effizienter.
CHANGE_LOG_COLUMN_DISPLAY=Protokollspalte \u00e4ndern (Sync)
CHANGE_LOG_COLUMN_HELP==<b>\u00c4nderungsprotokollspalte</b><br>In der \u00c4nderungsprotokollspalte wird das letzte \u00c4nderungsdatum gespeichert. Durch Bereitstellen dieses Wertes werden die Sync-Funktionen aktiviert.
DATASOURCE_DISPLAY=Datenquellenpfad
DATASOURCE_HELP=<b>JDBC-Datenquellenname/Pfad</b><br>Geben Sie den JDBC-Datenquellenname/Pfad f\u00fcr die Verbindung mit dem Oracle-Server ein. Wenn dieser Wert angegeben ist, versucht der Konnektor nur mit der Datenquelle eine Verbindung herzustellen und ignoriert andere angegebene Ressourcenparameter.<br>der Beispielwert ist: <CODE>jdbc/SampleDataSourceName</CODE>
JNDI_PROPERTIES_DISPLAY=Urspr\u00fcngliche JNDI-Eigenschaften
JNDI_PROPERTIES_HELP=<b>Urspr\u00fcngliche JNDI-Eigenschaften</b><br>Kann leer sein, oder Sie geben den JDBC JNDI Initial Context Factory, Context-Anbieter in dem Format Schl\u00fcssel = Wert ein.


name.blank=Das Name-Attribut darf nicht Null lauten oder leer sein.
pwd.blank=Das Password-Attribut darf nicht Null lauten oder leer sein.
invalid.jndi.entry=Ung\u00fcltiger Wert im JNDI-Eintrag: {0}.
configuration.property.empty=Die Eigenschaft {0} ist leer.
key.column.blank=Die Konfigurationseigenschaft f\u00fcr den Schl\u00fcssel-Spaltennamen ist leer.
pwd.column.blank=Die Konfigurationseigenschaft f\u00fcr den Passwort-Spaltennamen ist leer.
changelog.column.blank=Die Konfigurationseigenschaft f\u00fcr den \u00c4nderungsprotokoll-Spaltennamen ist leer.
table.blank=Die Konfigurationseigenschaft f\u00fcr die Tabelle ist leer.
admin.user.blank=Die Konfigurationseigenschaft \u201eBenutzer\u201c ist leer.
admin.password.blank=Die Konfigurationseigenschaft \u201ePasswort\u201c ist leer.
host.blank=Die Konfigurationseigenschaft \u201eHost\u201c ist leer.
port.blank=Die Konfigurationseigenschaft \u201ePort\u201c ist leer.
database.blank=Die Konfigurationseigenschaft \u201eDatenbank\u201c ist leer.
jdbc.template.blank=Die Konfigurationseigenschaft f\u00fcr die URL der JDBC-Verbindung ist leer.
jdbc.driver.blank=Die Konfigurationseigenschaft \u201eJDBC-Treiber\u201c ist leer.
jdbc.driver.not.found=Der JDBC-Treiber konnte nicht im Klassenpfad gefunden werden.
invalid.quoting=Ung\u00fcltige Anf\u00fchrungszeichen '{0}'.
acount.object.class.required=Vorgang erfordert eine 'Konto' 'Objektklasse'.
auth.op.not.supported=Ein Authentifizierungsvorgang wird nicht unterst\u00fctzt.
auth.op.failed=Die Authentifizierung des Benutzers {0} ist fehlgeschlagen.
invalid.attribute.set=Ung\u00fcltige Attribute gesetzt.
uid.blank=F\u00fcr diesen Vorgang ist eine g\u00fcltige UID erforderlich!
result.handler.null=Die Behandlungsroutine des Ergebnisses ist Null.
passwd.column.eq.key.column=Die Passwortspalte darf nicht die gleiche Spalte wie die Schl\u00fcsselspalte sein.
passwd.column.eq.change.log.column=Die Passwortspalte darf nicht die gleiche Spalte wie die \u00c4nderungsprotokollspalte sein.
key.column.eq.change.log.column=Die Schl\u00fcsselspalte darf nicht die gleiche Spalte wie die \u00c4nderungsprotokollspalte sein.
query.invalid=Die Validierung der Verbindungsabfrage '{0}' hat keinen Ergebnissatz zur\u00fcckgegeben.
more.users.deleted=L\u00f6schen des Kontos ung\u00fcltig, die UID '{0}' enth\u00e4lt mehrere Datens\u00e4tze. 
invalid.sync.token.value=Der Sync-Tokenwert ist ung\u00fcltig.
