# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=Conector LDAP

# Configuration properties.
host.display=Host
host.help=O nome ou o endere\u00e7o IP do host onde o servidor LDAP est\u00e1 sendo executado.
port.display=Porta TCP
port.help=O n\u00famero da porta TCP/IP usada na comunica\u00e7\u00e3o com o servidor LDAP.
ssl.display=SSL
ssl.help=Marque a caixa de sele\u00e7\u00e3o para se conectar ao servidor LDAP usando SSL.
failover.display=Servidores de failover
failover.help=Lista todos os servidores que dever\u00e3o ser usados para failover caso o servidor preferencial falhe. Se o servidor preferencial falhar, o JNDI se conectar\u00e1 no pr\u00f3ximo servidor dispon\u00edvel na lista. Lista todos os servidores no formato "ldap://ldap.example.com:389/", que segue os URLs LDAP v3 padr\u00e3o descritos no RFC 2255. Somente as partes do host e da porta do URL s\u00e3o relevantes nessa configura\u00e7\u00e3o.
principal.display=Principal
principal.help=O nome distinto com o qual fazer a autentica\u00e7\u00e3o no servidor LDAP.
credentials.display=Senha
credentials.help=Senha do principal.
baseContexts.display=Contextos base
baseContexts.help=Um ou mais pontos de partida na \u00e1rvore LDAP que ser\u00e3o usados ao pesquisar a \u00e1rvore. As pesquisas s\u00e3o realizadas ao localizar usu\u00e1rios do servidor LDAP ou ao procurar os grupos dos quais o usu\u00e1rio \u00e9 membro.
passwordAttribute.display=Atributo de senha
passwordAttribute.help=O nome do atributo LDAP que cont\u00e9m a senha. Quando a senha do usu\u00e1rio \u00e9 alterada, a nova senha \u00e9 definida como esse atributo.
accountObjectClasses.display=Classes de objetos de conta
accountObjectClasses.help=A classe ou as classes de objetos que ser\u00e3o usadas ao criar novos objetos de usu\u00e1rio na \u00e1rvore LDAP. Ao introduzir mais de uma classe de objeto, cada entrada deve estar em sua pr\u00f3pria linha. N\u00e3o use v\u00edrgulas ou pontos-e-v\u00edrgulas para separar classes de m\u00faltiplos objetos. Algumas classes de objeto poder\u00e3o necessitar que sejam especificadas todas as classes de objeto na hierarquia de classes.
accountUserNameAttributes.display=Atributos do nome do usu\u00e1rio da conta
accountUserNameAttributes.help=Atributo ou atributos que cont\u00eam o nome do usu\u00e1rio da conta. Eles ser\u00e3o usados na autentica\u00e7\u00e3o para localizar a entrada LDAP relativa ao nome do usu\u00e1rio a ser autenticado.
accountSearchFilter.display=Filtro LDAP para recupera\u00e7\u00e3o de contas
accountSearchFilter.help=Um filtro LDAP opcional para controlar que contas s\u00e3o retornadas a partir do recurso LDAP. Se nenhum filtro for especificado, somente as contas que incluam todas as classes de objetos especificados ser\u00e3o retornadas.
groupMemberAttribute.display=Atributo de membro de grupo
groupMemberAttribute.help=O nome do atributo de grupo que ser\u00e1 atualizado com o nome distinto do usu\u00e1rio quando usu\u00e1rio for adicionado ao grupo.
maintainLdapGroupMembership.display=Manter membros do grupo LDAP
maintainLdapGroupMembership.help=Quando ativado e um usu\u00e1rio \u00e9 renomeado ou exclu\u00eddo, atualiza quaisquer grupos LDAP aos quais o usu\u00e1rio pertence, para refletir o novo nome. Caso contr\u00e1rio, o recurso LDAP dever\u00e1 manter a integridade referencial com respeito aos membros do grupo. 
maintainPosixGroupMembership.display=Manter membros do grupo POSIX
maintainPosixGroupMembership.help=Quando ativado e um usu\u00e1rio \u00e9 renomeado ou exclu\u00eddo, atualiza quaisquer grupos POSIX aos quais o usu\u00e1rio pertence, para refletir o novo nome. Caso contr\u00e1rio, o recurso LDAP dever\u00e1 manter a integridade referencial com respeito aos membros do grupo. 
passwordHashAlgorithm.display=Algoritmo hash da senha
passwordHashAlgorithm.help=Indica o algoritmo que o sistema de identifica\u00e7\u00e3o deve usar para verificar a senha. Os valores suportados no momento s\u00e3o SSHA, SHA, SMD5 e MD5. Um valor em branco indica que o sistema n\u00e3o verificar\u00e1 as senhas. Isso faz com que as senhas de texto simples sejam armazenadas em LDAP, a menos que o servidor LDAP execute a comprova\u00e7\u00e3o (o Netscape Directory Server e o iPlanet Directory Server fazem isso).
respectResourcePasswordPolicyChangeAfterReset.display=Respeitar pol\u00edtica de senha de recurso Alterar-ap\u00f3s-redefinir
respectResourcePasswordPolicyChangeAfterReset.help=Quando este recurso est\u00e1 especificado em um m\u00f3dulo de logon (ou seja, este recurso \u00e9 um destino de autentica\u00e7\u00e3o de passagem) e a pol\u00edtica de senha do recurso est\u00e1 configurada para alterar-ap\u00f3s-redefinir, um usu\u00e1rio cuja senha da conta de recurso tenha sido redefinida administrativamente ser\u00e1 obrigado a alterar essa senha ap\u00f3s a autentica\u00e7\u00e3o com \u00eaxito.
useBlocks.display=Utilizar blocos
useBlocks.help=Ao realizar opera\u00e7\u00f5es com um grande n\u00famero de contas, as contas s\u00e3o processadas em blocos para reduzir a quantidade de mem\u00f3ria utilizada pela opera\u00e7\u00e3o. Selecione essa op\u00e7\u00e3o para processar as contas em blocos.
blockSize.display=Tamanho do bloco
blockSize.help=O n\u00famero m\u00e1ximo de contas que um bloco pode conter quando as contas forem recuperadas em blocos.
usePagedResultControl.display=Usar controle de resultados paginados
usePagedResultControl.help=Quando ativado, o controle de resultados paginados LDAP tem prefer\u00eancia sobre o controle VLV ao recuperar contas.
vlvSortAttribute.display=Atributo de classifica\u00e7\u00e3o VLV
vlvSortAttribute.help=Especifique o atributo de classifica\u00e7\u00e3o a ser usado para os \u00edndices VLV no recurso.
uidAttribute.display=Atributo Uid
uidAttribute.help=O nome do atributo LDAP que \u00e9 mapeado para o atributo Uid.
readSchema.display=Ler esquema
readSchema.help=Se verdadeiro, o conector ler\u00e1 o esquema no servidor. Se falso, o conector fornecer\u00e1 um esquema padr\u00e3o baseado nas classes de objetos da configura\u00e7\u00e3o. Para que classes de objetos estendidas sejam usadas, essa propriedade precisa ser verdadeira.
extendedObjectClasses.display=Classes de objetos estendidas
extendedObjectClasses.help=Classes de objetos adicionais a serem fornecidas no esquema. Se essa propriedade n\u00e3o estiver em branco, a propriedade "readSchema" dever\u00e1 ser definida como verdadeira.
baseContextsToSynchronize.display=Contextos base para sincroniza\u00e7\u00e3o
baseContextsToSynchronize.help=Um ou mais pontos de partida na \u00e1rvore LDAP que ser\u00e3o usados para determinar se uma altera\u00e7\u00e3o deve ser sincronizada. Se essa propriedade n\u00e3o estiver definida, o atributo Contextos base ser\u00e1 usado para sincronizar uma altera\u00e7\u00e3o.
objectClassesToSynchronize.display=Classes de objetos a sincronizar
objectClassesToSynchronize.help=As classes de objetos a serem sincronizadas. O log de altera\u00e7\u00f5es destina-se a todos os objetos e filtra as atualiza\u00e7\u00f5es com apenas as classes de objeto listadas. Voc\u00ea n\u00e3o dever\u00e1 listar as superclasses de uma classe de objeto a menos que pretenda sincronizar objetos com algum dos valores da superclasse. Por exemplo, se somente os objetos "inetOrgPerson" forem sincronizados, mas as superclasses de "inetOrgPerson" ("person", "organizationalperson" e "top") forem filtradas, somente "inetOrgPerson" ser\u00e1 listado aqui. Todos os objetos no LDAP s\u00e3o subclassificados em "top". Por essa raz\u00e3o, voc\u00ea nunca dever\u00e1 listar "top", caso contr\u00e1rio, nenhum objeto ser\u00e1 filtrado.
attributesToSynchronize.display=Atributos a sincronizar
attributesToSynchronize.help=Os nomes dos atributos a serem sincronizados. Isto ignora atualiza\u00e7\u00f5es a partir do registro de altera\u00e7\u00f5es se elas n\u00e3o atualizarem um dos atributos nomeados. Por exemplo, se apenas o "departamento" estiver listado, ent\u00e3o somente altera\u00e7\u00f5es que afetem o "departamento" ser\u00e3o processadas. Todas as outras atualiza\u00e7\u00f5es s\u00e3o ignoradas. Se for deixado em branco (o padr\u00e3o), ent\u00e3o todas as altera\u00e7\u00f5es ser\u00e3o processadas.
modifiersNamesToFilterOut.display=Filtrar altera\u00e7\u00f5es por
modifiersNamesToFilterOut.help=Os nomes (DNs) de administradores de diret\u00f3rios para filtrar nas altera\u00e7\u00f5es. Altera\u00e7\u00f5es com o atributo "modifiersName" que correspondam \u00e0s entradas desta lista ser\u00e3o filtradas. Para evitar loops, o valor padr\u00e3o \u00e9 o nome do administrador usado por este adaptador. As entradas devem ser no formato "cn=Gerenciador de diret\u00f3rios".
accountSynchronizationFilter.display=Filtro LDAP para contas a sincronizar
accountSynchronizationFilter.help=Um filtro LDAP opcional para os objetos a sincronizar. Por causa do registro de altera\u00e7\u00e3o ser para todos os objetos, este filtro atualiza somente objetos que correspondam ao filtro especificado. Se voc\u00ea especificar um filtro, um objeto ser\u00e1 sincronizado somente se ele corresponder ao filtro e incluir uma classe de objetos sincronizada.
changeLogBlockSize.display=Tamanho do bloco de registro de altera\u00e7\u00e3o
changeLogBlockSize.help=O n\u00famero de entradas de registro de altera\u00e7\u00e3o a obter por consulta.
changeNumberAttribute.display= Atributo do n\u00famero de altera\u00e7\u00e3o
changeNumberAttribute.help=O nome do atributo do n\u00famero de altera\u00e7\u00e3o na entrada do registro de altera\u00e7\u00e3o.
filterWithOrInsteadOfAnd.display=Filtrar com OR em vez de AND
filterWithOrInsteadOfAnd.help=Normalmente, o filtro usado para obter entradas de registro de altera\u00e7\u00e3o \u00e9 um filtro baseado em AND que recupera um intervalo de entradas de altera\u00e7\u00e3o. Se essa propriedade estiver definida, o filtro ser\u00e1 aplicado ou, em vez disso, conjuntamente aos n\u00fameros de altera\u00e7\u00f5es necess\u00e1rios.
removeLogEntryObjectClassFromFilter.display=Remover classe de objeto de entrada de registro do filtro
removeLogEntryObjectClassFromFilter.help=Se essa propriedade estiver definida (o padr\u00e3o), o filtro usado para obter as entradas de registro de altera\u00e7\u00e3o n\u00e3o conter\u00e1 a classe de objeto "changeLogEntry", esperando que n\u00e3o haja entradas de outros tipos de objetos no registro de altera\u00e7\u00e3o.
synchronizePasswords.display=Ativar sincroniza\u00e7\u00e3o de senhas
synchronizePasswords.help=Se verdadeiro, o conector sincronizar\u00e1 senhas. \u00c9 necess\u00e1rio instalar o Plug-in de captura de senha para que a sincroniza\u00e7\u00e3o de senhas funcione.
passwordAttributeToSynchronize.display=Atributo de senha para sincroniza\u00e7\u00e3o
passwordAttributeToSynchronize.help=O nome do atributo de senha a ser sincronizado durante a sincroniza\u00e7\u00e3o de senhas.
passwordDecryptionKey.display=Chave de descriptografia de senha
passwordDecryptionKey.help=A senha com a qual descriptografar senhas durante a sincroniza\u00e7\u00e3o de senhas.
passwordDecryptionInitializationVector.display=Vetor de inicializa\u00e7\u00e3o da descriptografia de senha
passwordDecryptionInitializationVector.help=O vetor de inicializa\u00e7\u00e3o com o qual descriptografar senhas durante a sincroniza\u00e7\u00e3o de senhas.

# Configuration properties validation.
host.notBlank=O host n\u00e3o pode ficar em branco
port.legalValue=O n\u00famero da porta deve ser de 0 a 65535
baseContexts.notEmpty=A lista de contextos base n\u00e3o pode ficar vazia
baseContexts.noBlankValues=A lista de contextos base n\u00e3o pode conter valores em branco
baseContexts.noInvalidLdapNames=O contexto base {0} n\u00e3o pode ser analisado
passwordAttribute.notBlank=O atributo de senha n\u00e3o pode ficar em branco
accountObjectClasses.notEmpty=A lista de classes de objetos de conta n\u00e3o pode ficar vazia
accountObjectClasses.noBlankValues=A lista de classes de objetos de conta n\u00e3o pode conter valores em branco
accountUserNameAttributes.notEmpty=A lista de atributos do nome do usu\u00e1rio da conta n\u00e3o pode ficar vazia
accountUserNameAttributes.noBlankValues=A lista de atributos do nome do usu\u00e1rio da conta n\u00e3o pode conter valores em branco
groupMemberAttribute.notBlank=O atributo de membro de grupo n\u00e3o pode ficar em branco
blockSize.legalValue=O tamanho do bloco deve ser maior que 0
vlvSortAttribute.notBlank=O atributo de classifica\u00e7\u00e3o VLV n\u00e3o pode ficar em branco
uidAttribute.notBlank=O atributo de mapeamento para Uid n\u00e3o pode ficar em branco
extendedObjectClasses.notBlank=A lista de classes de objetos estendidas n\u00e3o pode conter valores em branco
readSchema.mustBeTrueWithExtendedObjectClasses=Para que classes de objetos estendidas sejam usadas, a propriedade readSchema dever\u00e1 ser verdadeira
baseContextsToSynchronize.noBlankValues=A lista de contextos base para sincroniza\u00e7\u00e3o n\u00e3o pode conter valores em branco
baseContextsToSynchronize.noInvalidLdapNames=O contexto base para sincroniza\u00e7\u00e3o {0} n\u00e3o pode ser analisado
objectClassesToSynchronize.notEmpty=A lista de classes de objetos para sincroniza\u00e7\u00e3o n\u00e3o pode ficar vazia
objectClassesToSynchronize.noBlankValues=A lista de classes de objetos para sincroniza\u00e7\u00e3o n\u00e3o pode conter valores em branco
attributesToSynchronize.noBlankValues=A lista de atributos para sincroniza\u00e7\u00e3o n\u00e3o pode conter valores em branco
modifiersNamesToFilterOut.noBlankValues=A lista de nomes dos modificadores para filtragem n\u00e3o pode conter valores em branco
modifiersNamesToFilterOut.noInvalidLdapNames=O nome do modificador para filtragem {0} n\u00e3o pode ser analisado
changeNumberAttribute.notBlank=O atributo do n\u00famero de altera\u00e7\u00e3o n\u00e3o pode ficar em branco
changeLogBlockSize.legalValue=O tamanho do bloco de sincroniza\u00e7\u00e3o deve ser maior que 0
passwordAttributeToSynchronize.notBlank=O atributo de senha para sincroniza\u00e7\u00e3o n\u00e3o pode ficar em branco
decryptionKey.notBlank=A chave de descriptografia n\u00e3o pode ficar em branco
decryptionInitializationVector.notBlank=O vetor de inicializa\u00e7\u00e3o da descriptografia n\u00e3o pode ficar em branco

entryNotFound=A entrada "{0}" n\u00e3o foi encontrada
readingPasswordsNotSupported=N\u00e3o existe suporte para o retorno de senhas de uma opera\u00e7\u00e3o de pesquisa

memberAlreadyInGroup=O membro "{0}" j\u00e1 existe no grupo "{1}"
cannotRemoveBecausePosixMember=N\u00e3o ser\u00e1 poss\u00edvel remover o atributo "{0}" se o usu\u00e1rio for membro de grupos POSIX
cannotAddToPosixGroup=N\u00e3o \u00e9 poss\u00edvel adicionar a entrada "{0}" a grupos POSIX porque ela n\u00e3o tem um atributo "{1}"

noUserMatched=Nenhum usu\u00e1rio corresponde a "{0}"
authenticationFailed=Falha na autentica\u00e7\u00e3o de "{0}"
moreThanOneUserMatched=Mais de um usu\u00e1rio corresponde a "{0}", mas nenhum corresponde \u00e0 senha
moreThanOneUserMatchedWithPassword=Mais de um usu\u00e1rio corresponde a "{0}" e tem a mesma senha
