# -- START LICENSE
# ====================
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
# 
# Copyright 2008-2009 Sun Microsystems, Inc. All rights reserved.     
# 
# The contents of this file are subject to the terms of the Common Development 
# and Distribution License("CDDL") (the "License").  You may not use this file 
# except in compliance with the License.
# 
# You can obtain a copy of the License at 
# http://IdentityConnectors.dev.java.net/legal/license.txt
# See the License for the specific language governing permissions and limitations 
# under the License. 
# 
# When distributing the Covered Code, include this CDDL Header Notice in each file
# and include the License file at identityconnectors/legal/license.txt.
# If applicable, add the following below this CDDL Header, with the fields 
# enclosed by brackets [] replaced by your own identifying information: 
# "Portions Copyrighted [year] [name of copyright owner]"
# ====================
# -- END LICENSE
LdapConnector=Conector LDAP

# Configuration properties.
host.display=Host
host.help=El nombre o la direcci\u00f3n IP del host donde se est\u00e1 ejecutando el servidor LDAP.
port.display=Puerto TCP
port.help=El n\u00famero de puerto TCP/IP utilizado para comunicarse con el servidor LDAP.
ssl.display=SSL
ssl.help=Marque la casilla para conectarse al servidor LDAP utilizando SSL.
failover.display=Servidores de conmutaci\u00f3n por errores
failover.help=Lista de todos los servidores que deben utilizarse para la reconexi\u00f3n de emergencia si falla el servidor preferido. Si falla el servidor preferido, JNDI se conectar\u00e1 al siguiente servidor disponible de la lista. Los servidores deben indicarse en la lista con la sintaxis "ldap://ldap.example.com:389/", que sigue las URL est\u00e1ndar de LDAP v3 descritas en RFC 2255. En esta configuraci\u00f3n s\u00f3lo son relevantes las porciones de host y puerto de la URL.
principal.display=Principal
principal.help=El nombre distinguido con el cual se debe autenticar en el servidor LDAP.
credentials.display=Contrase\u00f1a
credentials.help=Contrase\u00f1a para el principal.
baseContexts.display=Contextos base
baseContexts.help=Uno o varios puntos de partida en el \u00e1rbol LDAP que se utilizar\u00e1n al realizar b\u00fasquedas en el \u00e1rbol. Las b\u00fasquedas se realizan cuando se descubren usuarios del servidor LDAP o cuando se buscan los grupos de los cuales un usuario es miembro.
passwordAttribute.display=Atributo de contrase\u00f1a
passwordAttribute.help=El nombre del atributo LDAP que contiene la contrase\u00f1a. Cuando se cambia la contrase\u00f1a de un usuario, la nueva contrase\u00f1a se configura en este atributo.
accountObjectClasses.display=Clases de objeto de cuenta
accountObjectClasses.help=La clase o clases de objeto que se utilizar\u00e1n al crear nuevos objetos de usuario en el \u00e1rbol LDAP. Al introducir m\u00e1s de una clase de objeto, cada entrada deber\u00e1 estar en su propia l\u00ednea; no utilice comas o puntos y coma para separar varias clases de objeto. Algunas clases de objeto pueden requerir que especifique todas las clases de objeto presentes en la jerarqu\u00eda de clases.
accountUserNameAttributes.display=Atributos de nombre de usuario de cuenta
accountUserNameAttributes.help=Atributo o atributos que contienen el nombre de usuario de la cuenta. Se utilizar\u00e1n al autenticar para encontrar la entrada de LDAP correspondiente al nombre de usuario que se autentica.
accountSearchFilter.display=Filtro de LDAP para recuperar cuentas
accountSearchFilter.help=Un filtro de LDAP opcional para controlar las cuentas que se van a devolver procedentes del recurso LDAP. Si no se especifica ning\u00fan filtro, s\u00f3lo se devolver\u00e1n las cuentas que incluyan todas las clases de objeto especificadas.
groupMemberAttribute.display=Atributo de miembro de grupo
groupMemberAttribute.help=El nombre del atributo de grupo que se actualizar\u00e1 con el nombre distinguido del usuario cuando \u00e9ste se a\u00f1ada al grupo.
maintainLdapGroupMembership.display=Mantener miembros de grupo de LDAP
maintainLdapGroupMembership.help=Con esta opci\u00f3n habilitada, si se renombra o elimina un usuario, todos los grupos de LDAP a los que pertenece el usuario se actualizan para reflejar el nuevo nombre. De lo contrario, el recurso de LDAP debe conservar la integridad referencial con respecto a la pertenencia a grupos.
maintainPosixGroupMembership.display=Mantener miembros de grupo de POSIX
maintainPosixGroupMembership.help=Con esta opci\u00f3n habilitada, si se renombra o elimina un usuario, todos los grupos de POSIX a los que pertenece el usuario se actualizan para reflejar el nuevo nombre. De lo contrario, el recurso de LDAP debe conservar la integridad referencial con respecto a la pertenencia a grupos.
passwordHashAlgorithm.display=Algoritmo de c\u00e1lculo de claves de contrase\u00f1as
passwordHashAlgorithm.help=Indica el algoritmo que deber\u00e1 utilizar el sistema Identity para incluir claves en la contrase\u00f1a. Los valores admitidos actualmente son SSHA, SHA, SMD5 y MD5. Un valor en blanco indica que el sistema no incluir\u00e1 claves en las contrase\u00f1as. Esto har\u00e1 que se almacenen en LDAP contrase\u00f1as de texto simple a menos que el servidor LDAP realice el c\u00e1lculo de claves (Netscape Directory Server e iPlanet Directory Server realizan esta acci\u00f3n).
respectResourcePasswordPolicyChangeAfterReset.display=Respetar cambio de directiva de contrase\u00f1as de recurso tras restablecer
respectResourcePasswordPolicyChangeAfterReset.help=Cuando se ha especificado este recurso en un m\u00f3dulo de inicio de sesi\u00f3n (es decir, este recurso es un destino de autenticaci\u00f3n al paso) y la directiva de contrase\u00f1as del recurso est\u00e1 configurada para cambiar tras restablecer, si se ha restablecido administrativamente la contrase\u00f1a de la cuenta de recursos de un usuario, se pedir\u00e1 al usuario que cambie dicha contrase\u00f1a una vez que se haya autenticado correctamente.
useBlocks.display=Utilizar bloques
useBlocks.help=Al ejecutar operaciones con un gran n\u00famero de cuentas, \u00e9stas se procesan en bloques para reducir la cantidad de memoria utilizada por la operaci\u00f3n. Seleccione esta opci\u00f3n para procesar las cuentas en bloques.
blockSize.display=Tama\u00f1o de bloque
blockSize.help=El n\u00famero m\u00e1ximo de cuentas que puede haber en un bloque al recuperar cuentas en bloques.
usePagedResultControl.display=Usar control de resultados paginados
usePagedResultControl.help=Cuando esta opci\u00f3n se encuentra habilitada, se prefiere el control de resultados paginados de LDAP sobre el control de VLV al recuperar las cuentas.
vlvSortAttribute.display=Atributo de clasificaci\u00f3n VLV
vlvSortAttribute.help=Especifique el atributo de clasificaci\u00f3n que se utilizar\u00e1 para los \u00edndices VLV en el recurso.
uidAttribute.display=Atributo de Uid
uidAttribute.help=El nombre del atributo de LDAP que se asigna al atributo de Uid.
readSchema.display=Esquema de lectura
readSchema.help=Si su valor es verdadero (true), el conector leer\u00e1 el esquema desde el servidor. Si es falso, el conector suministrar\u00e1 un esquema predeterminado basado en las clases de objeto de la configuraci\u00f3n. Esta propiedad debe ser verdadera para poder utilizar clases de objeto extendidas.
baseContextsToSynchronize.display=Contexto base para sincronizar
baseContextsToSynchronize.help=Uno o m\u00e1s puntos de partida del \u00e1rbol LDAP que se usar\u00e1n para determinar si se debe sincronizar un cambio. Si no se configura esta propiedad, se utilizar\u00e1 el atributo de contextos base para sincronizar un cambio.
objectClassesToSynchronize.display=Clases de objetos que sincronizar
objectClassesToSynchronize.help=Las clases de objetos que se deben sincronizar. El registro de cambios se aplica a todos los objetos. Este filtro s\u00f3lo actualiza las clases de objetos mostradas en la lista. No se deben listar las superclases de una clase de objeto, a menos que se deseen sincronizar objetos con cualquiera de los valores de superclase. Por ejemplo, si s\u00f3lo se deben sincronizar objetos "inetOrgPerson", pero las superclases de "inetOrgPerson" ("person", "organizationalperson" y "top") se deben filtrar, entonces liste s\u00f3lo "inetOrgPerson" aqu\u00ed. Todos los objetos en LDAP son subclases de "top". Por este motivo, no deber\u00e1 listar nunca "top"; en caso contrario, no se filtrar\u00e1 ning\u00fan objeto.
attributesToSynchronize.display=Atributos que sincronizar
attributesToSynchronize.help=El nombre de los atributos que se deben sincronizar. Esta opci\u00f3n ignora las actualizaciones del registro de cambios si no se actualizan ningunos de los atributos con nombre. Por ejemplo, si s\u00f3lo aparece "departamento", se procesar\u00e1n los cambios que afecten \u00fanicamente a "departamento". Las dem\u00e1s actualizaciones no se tendr\u00e1n en cuenta. Si se deja en blanco (opci\u00f3n predeterminada), se procesar\u00e1n todos los cambios.
modifiersNamesToFilterOut.display=Filtrar cambios por
modifiersNamesToFilterOut.help=Los nombres (ND) de los administradores de Directory que se filtran en los cambios. Se filtrar\u00e1n los cambios con el atributo "modifiersName" que coincidan con las entradas de esta lista. El valor est\u00e1ndar es el nombre del administrador que este adaptador emplea, para evitar bucles. Las entradas deber\u00e1n tener el formato "cn=Directory Manager".
accountSynchronizationFilter.display=Filtro de LDAP para cuentas que sincronizar
accountSynchronizationFilter.help=Un filtro de LDAP opcional para los objetos que se deben sincronizar. Como el registro de cambios es para todos los objetos, este filtro actualiza s\u00f3lo los objetos que coincidan con el filtro especificado. Si especifica un filtro, s\u00f3lo se sincronizar\u00e1 un objeto si coincide con el filtro e incluye una clase de objeto sincronizada.
changeLogBlockSize.display=Tama\u00f1o de bloque de registro de cambios
changeLogBlockSize.help=N\u00famero de entradas del registro de cambios que se recopilan por consulta.
changeNumberAttribute.display=Atributo de cambio de n\u00famero
changeNumberAttribute.help=El nombre del atributo de cambio de n\u00famero en la entrada del registro de cambios.
filterWithOrInsteadOfAnd.display=Filtrar con Or en vez de And
filterWithOrInsteadOfAnd.help=Para recopilar las entradas del registro de cambios se usa normalmente un filtro basado en And que recupera un intervalo de entradas de cambios. Si se configura esta propiedad, el filtro aplicar\u00e1 Or conjuntamente a los n\u00fameros de cambios necesarios.
removeLogEntryObjectClassFromFilter.display=Suprimir del filtro la clase de objeto de entrada de registro 
removeLogEntryObjectClassFromFilter.help=Si se configura esta propiedad (valor predeterminado), las entradas del registro de cambios se recopilan aplicando un filtro que no contiene la clase de objeto "changeLogEntry", con la expectativa de que no hay entradas de otros tipos de objeto en el registro de cambios.
synchronizePasswords.display=Habilitar sincronizaci\u00f3n de contrase\u00f1as
synchronizePasswords.help=Si su valor es verdadero, el conector sincronizar\u00e1 las contrase\u00f1as. Para que funcione la sincronizaci\u00f3n de contrase\u00f1as se debe instalar el complemento de captura de contrase\u00f1as.
passwordAttributeToSynchronize.display=Atributo de contrase\u00f1a para sincronizar
passwordAttributeToSynchronize.help=El nombre del atributo de contrase\u00f1a usado para sincronizar al realizar sincronizaci\u00f3n de contrase\u00f1as.
passwordDecryptionKey.display=Clave de descifrado de contrase\u00f1as
passwordDecryptionKey.help=La clave que se usa para descifrar las contrase\u00f1as al realizar sincronizaci\u00f3n de contrase\u00f1as.
passwordDecryptionInitializationVector.display=Vector de inicializaci\u00f3n de descifrado de contrase\u00f1as
passwordDecryptionInitializationVector.help=El vector de inicializaci\u00f3n que se usa para descifrar las contrase\u00f1as al realizar sincronizaci\u00f3n de contrase\u00f1as.

# Configuration properties validation.
host.notBlank=El host no puede quedar en blanco.
port.legalValue=El n\u00famero de puerto debe estar comprendido entre 0 y 65535
baseContexts.notEmpty=La lista de contextos base no puede quedar vac\u00eda
baseContexts.noBlankValues=La lista de contextos base no puede contener valores en blanco
baseContexts.noInvalidLdapNames=El contexto base {0} no se puede analizar
passwordAttribute.notBlank=El atributo de contrase\u00f1as no puede quedar en blanco
accountObjectClasses.notEmpty=La lista de clases de objeto de cuenta no puede quedar vac\u00eda
accountObjectClasses.noBlankValues=La lista de clases de objeto de cuenta no puede contener valores en blanco
accountUserNameAttributes.notEmpty=La lista de atributos de nombre de usuario de cuenta no puede quedar vac\u00eda
accountUserNameAttributes.noBlankValues=La lista de atributos de nombre de usuario de cuenta no puede contener valores en blanco
groupMemberAttribute.notBlank=El atributo de miembro de grupo no puede quedar en blanco
blockSize.legalValue=El tama\u00f1o de bloque debe ser mayor que 0
vlvSortAttribute.notBlank=El atributo de ordenaci\u00f3n de VLV no puede quedar en blanco
uidAttribute.notBlank=El atributo de asignaci\u00f3n a Uid no puede quedar en blanco
baseContextsToSynchronize.noBlankValues=La lista de contextos base para sincronizar no puede contener valores en blanco
baseContextsToSynchronize.noInvalidLdapNames=El contexto base para sincronizar {0} no se puede analizar
objectClassesToSynchronize.notEmpty=La lista de clases de objetos para sincronizar no puede quedar vac\u00eda
objectClassesToSynchronize.noBlankValues=La lista de clases de objetos para sincronizar no puede contener valores en blanco
attributesToSynchronize.noBlankValues=La lista de atributos para sincronizar no puede contener valores en blanco
modifiersNamesToFilterOut.noBlankValues=La lista de nombres de modificadores para filtrar no puede contener valores en blanco
modifiersNamesToFilterOut.noInvalidLdapNames=El nombre del modificador para filtrar {0} no se puede analizar
changeNumberAttribute.notBlank=El atributo de cambio de n\u00famero no puede quedar en blanco
changeLogBlockSize.legalValue=El tama\u00f1o de bloque de sincronizaci\u00f3n debe ser mayor que 0
passwordAttributeToSynchronize.notBlank=El atributo de contrase\u00f1a para sincronizar no puede quedar en blanco
decryptionKey.notBlank=La clave de descifrado no puede quedar en blanco
decryptionInitializationVector.notBlank=El vector de inicializaci\u00f3n de descifrado no puede quedar en blanco

entryNotFound=Entrada "{0}" no encontrada
readingPasswordsNotSupported=Una operaci\u00f3n de b\u00fasqueda no puede devolver contrase\u00f1as 

memberAlreadyInGroup=El miembro "{0}" ya existe en el grupo "{1}"
cannotRemoveBecausePosixMember=No se puede suprimir el atributo "{0}" cuando el usuario es un miembro de grupos POSIX 
cannotAddToPosixGroup=No se puede agregar la entrada "{0}" a grupos POSIX porque no tiene un atributo "{1}"

noUserMatched=Ning\u00fan usuario ha coincidido con "{0}"
authenticationFailed=Fall\u00f3 la autenticaci\u00f3n para "{0}"
moreThanOneUserMatched=M\u00e1s de un usuario ha coincidido con "{0}", pero ninguno ha coincidido con la contrase\u00f1a
moreThanOneUserMatchedWithPassword=Hay m\u00e1s de un usuario coincidente con "{0}" y con la misma contrase\u00f1a
